OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
/**************************************************************************//**
 * @file    spim.c
 * @version V1.00
 * @brief   SPIM driver source file
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#include <stdio.h>
#include <string.h>
#include "NuMicro.h"


/** @addtogroup Standard_Driver Standard Driver
  @{
*/

/** @addtogroup SPIM_Driver SPIM Driver
  @{
*/

/** @addtogroup SPIM_EXPORTED_FUNCTIONS SPIM Exported Functions
  @{
*/


/** @cond HIDDEN_SYMBOLS */


#define ENABLE_DEBUG                      0

#if ENABLE_DEBUG
    #define SPIM_DBGMSG   printf
#else
    #define SPIM_DBGMSG(...)   do { } while (0)      /* disable debug */
#endif

#ifndef SPIM_TRIM_HYPERDLL
    #define SPIM_TRIM_HYPERDLL            (1)
#endif

#define SPIM_ALTCTL0_DLL0TMEN_Pos         (8)
#define SPIM_ALTCTL0_DLL0TMEN_Msk         ((uint32_t)0x1U << SPIM_ALTCTL0_DLL0TMEN_Pos)

#define SPIM_DLL0ATCTL0_TUDOFF_Pos        (9)
#define SPIM_DLL0ATCTL0_TUDOFF_Msk        ((uint32_t)0x1U << SPIM_DLL0ATCTL0_TUDOFF_Pos)

#define SPIM_MLDOTCTL_MLDOPL0VT_Pos       (0)
#define SPIM_MLDOTCTL_MLDOPL0VT_Msk       ((uint32_t)0x3FU << SPIM_MLDOTCTL_MLDOPL0VT_Pos)

#define SPIM_MLDOTCTL_WRBUSY_Pos          (31)
#define SPIM_MLDOTCTL_WRBUSY_Msk          ((uint32_t)0x1U << SPIM_MLDOTCTL_WRBUSY_Pos)

#define SPIM_DLLTCTL_DLL0OLDOTRIM_Pos     (0)
#define SPIM_DLLTCTL_DLL0OLDOTRIM_Msk     ((uint32_t)0xFU << SPIM_DLLTCTL_DLL0OLDOTRIM_Pos)

#define SPIM_ENABLE_SYSDLL0TMEN()                                                       \
    do{                                                                                 \
        uint32_t u32Value = ((inpw(SYS_BASE + 0xE00UL)) | SPIM_ALTCTL0_DLL0TMEN_Msk);     \
        outpw((SYS_BASE + 0xE00UL), u32Value);                                            \
    }while(0)

#define SPIM_DISABLE_SYSDLL0TMEN()                                                      \
    do{                                                                                 \
        uint32_t u32Value = ((inpw(SYS_BASE + 0xE00UL)) & ~SPIM_ALTCTL0_DLL0TMEN_Msk);    \
        outpw((SYS_BASE + 0xE00UL), u32Value);                                            \
    }while(0)

#define SPIM_ENABLE_SYSDLL0ATCTL0_TRIMUPDOFF()                                          \
    do{                                                                                 \
        uint32_t u32Value = ((inpw(SYS_BASE + 0xF84UL)) & ~SPIM_DLL0ATCTL0_TUDOFF_Msk);   \
        outpw((SYS_BASE + 0xF84UL), u32Value);                                            \
    }while(0)

#define SPIM_DISABLE_SYSDLL0ATCTL0_TRIMUPDOFF()                                         \
    do{                                                                                 \
        uint32_t u32Value = ((inpw(SYS_BASE + 0xF84UL)) | SPIM_DLL0ATCTL0_TUDOFF_Msk);    \
        outpw((SYS_BASE + 0xF84UL), u32Value);                                            \
    }while(0)

#define SPIM_CEIL_DIV(x, y)               (((x) + (y) - 1U) / (y))

// Timing margin in permille (1000 = 100%). Set to 1100 to apply a +10% safety margin.
#define SPIM_TRIM_MARGIN                  (1000U)

//------------------------------------------------------------------------------
typedef struct
{
    uint32_t u32Saved;
    uint32_t u32Div;
    uint32_t u32RxClkDly;
} SPIM_DIV_CTX;

//------------------------------------------------------------------------------
static uint8_t gau8IDBuf[3] = {0};

static int32_t _SPIM_WriteData(SPIM_T *spim, const uint8_t *pu8TxBuf, uint32_t u32NTx, uint32_t u32NBit);
static int32_t _SPIM_ReadData(SPIM_T *spim, uint8_t *pu8RxBuf, uint32_t u32NRx, uint32_t u32NBit);
static void _SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit);
static void _SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit);
static void _SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit);
static void _SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit);
static void _SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit);
static int _SPIM_IsWriteDone(SPIM_T *spim, uint32_t u32NBit);
static int _SPIM_WaitWriteDone(SPIM_T *spim, uint32_t u32NBit);
static void _SPIM_EnableSpansionQuadMode(SPIM_T *spim, uint32_t u32IsEn);
static void _SPIM_EonSetQpiMode(SPIM_T *spim, int32_t i32IsEn);
static void _SPIM_SPANSION4BytesEnable(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit);
static void _SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx, const uint8_t pu8TxBuf[], uint8_t u8WrCmd,
                                      uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, uint32_t u32IsSync);
static int32_t _SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx,
                                                const uint8_t *pu8TxBuf, uint8_t u8WrCmd, uint32_t u32IsSync);
static void _SPIM_ClearContReadPhase(SPIM_T *spim, uint32_t u32OPMode);
static int32_t _SPIM_Sync4ByteAddrMode(SPIM_T *spim, uint32_t u32Is4ByteAddr, uint32_t u32CmdBit);
static uint32_t _SPIM_IsCrenAllowed(uint8_t u8Cmd);
static uint32_t _SPIM_GetPageChunkSize(uint32_t u32Addr, uint32_t u32Remain);
static int32_t _SPIM_ValidateDmaTransfer(uint32_t u32Addr, const void *pvBuf, uint32_t u32Count);
static int32_t _SPIM_Validate4ByteAddrMode(uint32_t u32ApiIs4ByteAddr, uint32_t u32PhaseIs4ByteAddr);

//------------------------------------------------------------------------------
/**
 * @brief    Switch SPIM output to the specified bit mode.
 * @param[in]  spim     Pointer to the SPIM peripheral.
 * @param[in]  u32NBit  Bit width to set for output mode.
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit mode (dual)
 *                      - \ref SPIM_BITMODE_4 : 4-bit mode (quad)
 *                      - \ref SPIM_BITMODE_8 : 8-bit mode (octal)
 * @return   None
 */
void SPIM_SwitchNBitOutput(SPIM_T *spim, uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case SPIM_BITMODE_2:
            SPIM_ENABLE_DUAL_OUTPUT_MODE(spim);     /* 2-bit, Output. */
            break;

        case SPIM_BITMODE_4:
            SPIM_ENABLE_QUAD_OUTPUT_MODE(spim);     /* 4-bit, Output. */
            break;

        case SPIM_BITMODE_8:
            SPIM_ENABLE_OCTAL_OUTPUT_MODE(spim);    /* 8-bit, Output. */
            break;

