OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
        case SPIM_BITMODE_1:
        default:
            SPIM_ENABLE_SING_OUTPUT_MODE(spim);     /* 1-bit, Output. */
            break;
    }
}

/**
 * @brief    Switch SPIM input to the specified bit mode.
 * @param[in]  spim     Pointer to the SPIM peripheral.
 * @param[in]  u32NBit  Bit width to set for input mode.
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit mode (dual)
 *                      - \ref SPIM_BITMODE_4 : 4-bit mode (quad)
 *                      - \ref SPIM_BITMODE_8 : 8-bit mode (octal)
 * @return     None
 */
void SPIM_SwitchNBitInput(SPIM_T *spim, uint32_t u32NBit)
{
    switch (u32NBit)
    {
        case SPIM_BITMODE_2:
            SPIM_ENABLE_DUAL_INPUT_MODE(spim);      /* 2-bit, Input.  */
            break;

        case SPIM_BITMODE_4:
            SPIM_ENABLE_QUAD_INPUT_MODE(spim);      /* 4-bit, Input.  */
            break;

        case SPIM_BITMODE_8:
            SPIM_ENABLE_OCTAL_INPUT_MODE(spim);     /* 8-bit, Input.  */
            break;

        case SPIM_BITMODE_1:
        default:
            SPIM_ENABLE_SING_INPUT_MODE(spim);      /* 1-bit, Input.  */
            break;
    }
}

/**
 * @brief      Check if the command is allowed to enable continuous read mode in DMM mode.
 * @param[in]  u8Cmd   Command opcode.
 * @return     SPIM_OP_ENABLE  : Allowed to enable continuous read mode.
 *             SPIM_OP_DISABLE : Not allowed to enable continuous read mode.
 */
static uint32_t _SPIM_IsCrenAllowed(uint8_t u8Cmd)
{
    uint32_t u32i;
    const uint8_t au8CrenAllowedCmds[] =
    {
        CMD_DMA_FAST_DUAL_READ,
        CMD_DMA_FAST_QUAD_READ,
        CMD_DMA_NORMAL_QUAD_READ,
        CMD_DMA_FAST_DUAL_DTR_READ,
        CMD_DMA_NORMAL_DTR_READ,
        CMD_DMA_FAST_QUAD_DTR_READ,
    };
    uint32_t u32CrenCmdCnt = (sizeof(au8CrenAllowedCmds) / sizeof(au8CrenAllowedCmds[0]));

    for (u32i = 0U; u32i < u32CrenCmdCnt; u32i++)
    {
        if (au8CrenAllowedCmds[u32i] == u8Cmd)
        {
            return SPIM_OP_ENABLE;
        }
    }

    return SPIM_OP_DISABLE;
}

static uint32_t _SPIM_GetPageChunkSize(uint32_t u32Addr, uint32_t u32Remain)
{
    uint32_t u32PageRemain = SPIM_FLH_PAGE_SIZE - (u32Addr & (SPIM_FLH_PAGE_SIZE - 1UL));

    return (u32Remain < u32PageRemain) ? u32Remain : u32PageRemain;
}

static int32_t _SPIM_ValidateDmaTransfer(uint32_t u32Addr, const void *pvBuf, uint32_t u32Count)
{
    uintptr_t uPtr = (uintptr_t)pvBuf;

    if (((u32Addr & 0x7UL) != 0UL) ||
            ((uPtr & 0x7UL) != 0UL) ||
            ((u32Count & 0x7UL) != 0UL))
    {
        return SPIM_ERR_FAIL;
    }

#if defined(UINTPTR_MAX) && (UINTPTR_MAX > 0xFFFFFFFFUL)

    if (uPtr > 0xFFFFFFFFUL)
    {
        return SPIM_ERR_FAIL;
    }

#endif

    return SPIM_OK;
}

static int32_t _SPIM_Validate4ByteAddrMode(uint32_t u32ApiIs4ByteAddr, uint32_t u32PhaseIs4ByteAddr)
{
    return (((u32ApiIs4ByteAddr != 0UL) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE) == u32PhaseIs4ByteAddr) ? SPIM_OK : SPIM_ERR_FAIL;
}

/**
 * @brief      Set SPIM clock divider to 16 and RX clock delay number to 0.
 *             This configuration is used for SPI Flash read/write operations.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  u32Restore  Enable or disable restoring the original SPIM clock divider
 *                         and RX clock delay number after operation.
 *                         - \ref SPIM_OP_ENABLE
 *                         - \ref SPIM_OP_DISABLE
 * @return     None
 */
static void SPIM_SetupConfigRegDiv(SPIM_T *spim, uint32_t u32Restore)
{
    static SPIM_DIV_CTX sSPIMCtx = {0};

    if (u32Restore)
    {
        if (sSPIMCtx.u32Saved)
        {
            SPIM_SET_CLOCK_DIVIDER(spim, sSPIMCtx.u32Div);
            SPIM_SET_RXCLKDLY_RDDLYSEL(spim, sSPIMCtx.u32RxClkDly);
            SPIM_DBGMSG("SPIM restored: DIV=%u, RXDLY=%u\r\n", sSPIMCtx.u32Div, sSPIMCtx.u32RxClkDly);
            sSPIMCtx.u32Saved = 0;
        }
    }
    else
    {
        if (!sSPIMCtx.u32Saved)
        {
            sSPIMCtx.u32Div      = SPIM_GET_CLOCK_DIVIDER(spim);
            sSPIMCtx.u32RxClkDly = SPIM_GET_RXCLKDLY_RDDLYSEL(spim);
            sSPIMCtx.u32Saved    = 1U;
            SPIM_DBGMSG("SPIM saved: DIV=%u, RXDLY=%u\r\n", sSPIMCtx.u32Div, sSPIMCtx.u32RxClkDly);
        }

        SPIM_SET_CLOCK_DIVIDER(spim, 16UL);
        SPIM_SET_RXCLKDLY_RDDLYSEL(spim, 0UL);
    }
}

/**
 * @brief      Write data to SPI slave in specified bit mode.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8TxBuf    Pointer to the transmit buffer.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode for data transmission.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK             Write operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT    Write operation failed due to timeout.
 */
static int32_t _SPIM_WriteData(SPIM_T *spim, const uint8_t *pu8TxBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* Write data to TX FIFO */
    uint32_t u32BufIdx = 0UL;   /* Transmit buffer index */
    uint32_t u32Tmp;            /* Temporary variable */
    uint32_t u32BurstSize;      /* Burst data number */
    uint32_t u32NTxTmp = u32NTx;

    /* Switch between N-bit output mode */
    SPIM_SwitchNBitOutput(spim, u32NBit);

    while (u32NTxTmp)
    {
        /* Calculate the number of data to be transferred in one burst */
        uint32_t u32ChunkSize = (u32NTxTmp >= 16UL) ? 4UL :
                                (u32NTxTmp >= 12UL) ? 3UL :
                                (u32NTxTmp >= 8UL) ? 2UL :
                                (u32NTxTmp >= 4UL) ? 1UL :
                                0UL; /* Data chunk size */

        if (u32ChunkSize)
        {
            /* Transfer data in burst mode */
            uint32_t u32i = u32ChunkSize; /* Loop index */

            while (u32i)
            {
                (void)memcpy((uint8_t *)&u32Tmp, &pu8TxBuf[u32BufIdx], sizeof(uint32_t));
                u32i--;
                spim->TX[u32i] = u32Tmp;
                u32BufIdx += 4UL;
                u32NTxTmp -= 4UL;
            }

            u32BurstSize = u32ChunkSize;
            u32ChunkSize = 4UL;
        }
        else
        {
            u32ChunkSize = u32NTxTmp;
            /* Transfer data in single mode */
            (void)memcpy((uint8_t *)&u32Tmp, &pu8TxBuf[u32BufIdx], u32NTxTmp);
            u32BurstSize = 1UL;
            u32NTxTmp = 0UL;
            spim->TX[0] = u32Tmp;
        }

        /* Switch to Normal mode */
        SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
        /* Set data width */
        SPIM_SET_DATA_WIDTH(spim, (u32ChunkSize * 8UL));
        /* Set burst data number */
        SPIM_SET_BURST_DATA(spim, u32BurstSize);

        /* Wait until transfer complete */
        if (SPIM_WaitOpDone(spim, SPIM_OP_ENABLE) != SPIM_OK)
        {
            return SPIM_ERR_TIMEOUT;
        }
    }

    return SPIM_OK;
}

/**
 * @brief      Read data from SPI slave using the specified bit mode.
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8RxBuf    Pointer to the receive buffer.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode for SPI transmission/reception.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK             Read operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT    Read operation aborted due to timeout.
 */
static int32_t _SPIM_ReadData(SPIM_T *spim, uint8_t *pu8RxBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /*
     * Read data in burst mode to improve performance.
     */
    uint32_t u32BufIdx = 0UL;       /* Buffer index */
    uint32_t u32NRxTmp = u32NRx;
    /* Configure SPIM to use N-bit input */
    SPIM_SwitchNBitInput(spim, u32NBit);

    while (u32NRxTmp)
    {
        /* Determine the number of data to be read in one burst */
        /* Number of data in one burst */
        uint32_t u32ChunkSize = (u32NRxTmp >= 16UL) ? 4UL : /* At least 16 bytes */
                                (u32NRxTmp >= 12UL) ? 3UL : /* 12 <= N < 16 */
                                (u32NRxTmp >= 8UL) ? 2UL : /* 8 <= N < 12 */
                                (u32NRxTmp >= 4UL) ? 1UL : /* 4 <= N < 8 */
                                0UL; /* N < 4 */
        uint32_t u32TmpChunkSize = u32ChunkSize;    /* Temporary value for chunk_size */
        uint32_t u32Tmp;                            /* Temporary variable for storing received data */
        uint32_t u32BurstSize = 0UL;                /* Number of data in one burst */

        if (u32ChunkSize)
        {
            /*
             * At least 2 data to be read in one burst, set burst size to
             * chunk_size.
             */
            u32BurstSize = u32ChunkSize;
            u32ChunkSize = 4UL;
        }
        else
        {
            /*
             * 1 data to be read, set burst size to 1 to read the data.
             */
            u32ChunkSize = u32NRxTmp;
            u32BurstSize = 1UL;
        }

        /* Configure SPIM to use Normal mode, N-bit data width and burst size */
        SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
        SPIM_SET_DATA_WIDTH(spim, (u32ChunkSize * 8UL));
        SPIM_SET_BURST_DATA(spim, u32BurstSize);

        /* Wait until transfer complete */
        if (SPIM_WaitOpDone(spim, SPIM_OP_ENABLE) != SPIM_OK)
        {
            return SPIM_ERR_TIMEOUT;
        }

        u32ChunkSize = u32TmpChunkSize;

        /* Read received data */
        if (u32ChunkSize >= 2UL)
        {
            /* Read multiple data in one burst */
            while (u32ChunkSize)
            {
                u32Tmp = spim->RX[u32ChunkSize - 1UL];
                (void)memcpy(&pu8RxBuf[u32BufIdx], (uint8_t *)&u32Tmp, sizeof(uint32_t));
                u32ChunkSize--;
                u32BufIdx += 4UL;
                u32NRxTmp -= 4UL;
            }
        }
        else
        {
            /* Read 1 data */
            u32Tmp = spim->RX[0];
            (void)memcpy(&pu8RxBuf[u32BufIdx], (uint8_t *)&u32Tmp, u32NRxTmp);
            u32BufIdx += u32NRxTmp;
            u32NRxTmp = 0UL;
        }
    }

    return SPIM_OK;
}

/**
 * @brief       Set operation mode.
 * @param[in]   spim        The pointer of the specified SPIM module.
 * @param[in]   u32OPMode   SPI Function Operation Mode
 *              - \ref SPIM_CTL0_OPMODE_IO
 *              - \ref SPIM_CTL0_OPMODE_PAGEWRITE
 *              - \ref SPIM_CTL0_OPMODE_PAGEREAD
 *              - \ref SPIM_CTL0_OPMODE_DIRECTMAP
 * \hideinitializer
 */
void SPIM_SET_OPMODE(SPIM_T *spim, uint32_t u32OPMode)
{
    volatile int32_t i32TimeOutCount = (int32_t)SPIM_TIMEOUT;

    /* Wait for DMM mode to be idle. */
    while (SPIM_GET_DMM_IDLE(spim) == SPIM_OP_DISABLE)
    {
        if (--i32TimeOutCount <= 0)
        {
            break;
        }
    }

    ((spim)->CTL0 = (((spim)->CTL0 & ~(SPIM_CTL0_OPMODE_Msk)) |
                     ((u32OPMode) << SPIM_CTL0_OPMODE_Pos)));
}

/**
 * @brief      Issue the "Read Status Register #1" command to the SPI Flash.
 * @param[out] pu8DataBuf  Pointer to the buffer to store the received status register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode for SPI transmission/reception.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
void SPIM_ReadStatusRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    const uint8_t au8CmdBuf[2] = {OPCODE_RDSR, OPCODE_RDSR};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

