OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    (void)SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8 : 0);

    (void)_SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Write Status Register #1" command to the SPI Flash.
 * @param[in]  pu8DataBuf  Pointer to the buffer containing data to be written.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode for SPI transmission.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
static void _SPIM_WriteStatusRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* 1-byte Write Status Register #1 command + 1-byte data. */
    uint8_t au8CmdBuf[4] = {OPCODE_WRSR, 0x00U, 0x00U, 0x00U};
    uint32_t u32NTxTmp;

    (void)u32NTx;

    au8CmdBuf[1] = (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? au8CmdBuf[0] : pu8DataBuf[0];
    au8CmdBuf[2] = pu8DataBuf[0];
    au8CmdBuf[3] = pu8DataBuf[0];

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    u32NTxTmp = ((SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 4UL : 2UL);
    (void)_SPIM_WriteData(spim, au8CmdBuf, u32NTxTmp, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Read Status Register #2" command.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[out] pu8DataBuf  Pointer to the buffer to store the received status register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for the command and data transfer.
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit mode (Dual)
 *                         - \ref SPIM_BITMODE_4 : 4-bit mode (Quad)
 *                         - \ref SPIM_BITMODE_8 : 8-bit mode (Octal)
 *
 * @return     None
 */
static void _SPIM_ReadStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    const uint8_t au8CmdBuf[2] = {OPCODE_RDSR2, OPCODE_RDSR2};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    (void)SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    (void)_SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the Winbond "Write Status Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral instance.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the status register values to write.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for command and data transfer:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_WriteStatusRegister2(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[6] = {OPCODE_WRSR, 0U, 0U, 0U, 0U, 0U};
    uint8_t u8DTREn = SPIM_GET_DTR_MODE(spim);
    uint32_t u32NTxTmp;

    (void)u32NTx;
    au8CmdBuf[1] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : au8CmdBuf[0];
    au8CmdBuf[2] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : pu8DataBuf[1];
    au8CmdBuf[3] = (u8DTREn == SPIM_OP_ENABLE) ? pu8DataBuf[0] : pu8DataBuf[1];
    au8CmdBuf[4] = pu8DataBuf[1];
    au8CmdBuf[5] = pu8DataBuf[1];

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    u32NTxTmp = (u8DTREn == SPIM_OP_ENABLE) ? 6UL : 3UL;
    (void)_SPIM_WriteData(spim, au8CmdBuf, u32NTxTmp, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

#if 0  /* not used */
/**
 * @brief      Issue the "Write Status Register #3" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the data to write to Status Register #3.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for command and data transfer:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void SPIM_WriteStatusRegister3(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    const uint8_t au8CmdBuf[] = {OPCODE_WRSR3, 0x00U};    /* 1-byte Write Status Register #2 command + 1-byte data. */
    au8CmdBuf[1] = pu8DataBuf[0];

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);        /* CS activated. */

    (void)_SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), u32NBit);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);        /* CS deactivated. */
}
#endif

/**
 * @brief      Issue the "Read Configuration Register #3" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for the configuration register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_ReadStatusRegister3(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    const uint8_t au8CmdBuf[2] = {OPCODE_RDSR3, OPCODE_RDSR3};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

