OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);
    (void)SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    (void)_SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

#if 0  /* not used */
/**
 * @brief      Issue the "Write Security Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[in]  pu8DataBuf  Pointer to the transmit buffer containing the data to write.
 * @param[in]  u32NTx      Number of bytes to transmit.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void SPIM_WriteSecurityRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NTx, uint32_t u32NBit)
{
    /* 1-byte Write Status Register #2 command + 1-byte data. */
    uint8_t au8CmdBuf[] = {OPCODE_WRSCUR, 0x00U};

    au8CmdBuf[1] = pu8DataBuf[0];

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}
#endif

/**
 * @brief      Issue the "Read Security Register" command.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for storing the security register data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 */
static void _SPIM_ReadSecurityRegister(SPIM_T *spim, uint8_t *pu8DataBuf, uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    const uint8_t au8CmdBuf[2] = {OPCODE_RDSCUR, OPCODE_RDSCUR};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    (void)SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8UL : 0UL);

    (void)_SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Issue the "Read Flag Status Register" command for Micron MT35X Octal SPI Flash.
 *
 * @param[in]  spim        Pointer to the SPIM peripheral instance.
 * @param[out] pu8DataBuf  Pointer to the receive buffer for storing the FSR data.
 * @param[in]  u32NRx      Number of bytes to receive.
 * @param[in]  u32NBit     Bit mode used for transmit/receive:
 *                         - \ref SPIM_BITMODE_1 : 1-bit mode
 *                         - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                         - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                         - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @return     None
 *
 * @note       This command is used to check the current status of internal operations,
 *             such as program or erase progress.
 */
static void _SPIM_ReadMT35xFlagRegister(SPIM_T *spim, uint8_t *pu8DataBuf,
                                        uint32_t u32NRx, uint32_t u32NBit)
{
    /* 1-byte Read Status Register #1 command. */
    const uint8_t au8CmdBuf[2] = {OPCODE_MICRON_RD_FLG, OPCODE_MICRON_RD_FLG};

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    (void)SPIM_IO_SendDummyByPhase(spim, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 8 : 0);

    (void)_SPIM_ReadData(spim, pu8DataBuf, u32NRx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Check whether the SPI Flash erase or write operation has completed.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit  Bit mode used for transmit/receive:
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @retval     1        Operation completed (Ready).
 * @retval     0        Operation still in progress (Busy).
 *
 * @note       Typically checks the WIP (Write-In-Progress) bit in the Flash status register.
 */
static int _SPIM_IsWriteDone(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t au8Status[2] = {0};
    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), u32NBit);
    return !(au8Status[0] & SR_WIP);
}

/**
 * @brief      Wait until the SPI Flash erase or write operation completes.
 *
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit  Bit mode used for transmit/receive:
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 *
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation timed out (erase/write did not complete in time).
 *
 * @note       This function typically polls the WIP (Write-In-Progress) bit in the SPI Flash
 *             Status Register until it is cleared, or until a timeout occurs.
 */
static int _SPIM_WaitWriteDone(SPIM_T *spim, uint32_t u32NBit)
{
    volatile uint32_t u32Count;
    int i32Ret = (int32_t)SPIM_ERR_FAIL;

    for (u32Count = 0UL; u32Count < (SystemCoreClock / 1000UL); u32Count++)
    {
        if (_SPIM_IsWriteDone(spim, u32NBit))
        {
            i32Ret = SPIM_OK;
            break;
        }
    }

    if (i32Ret != SPIM_OK)
    {
        SPIM_DBGMSG("spim_wait_write_done time-out!!\n");
    }

    return i32Ret;
}

/**
 * @brief      Wait for the SPIM operation to complete and optionally check the busy status.
 *
 * @param[in]  spim       Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsSync  Specify whether to wait until the operation completes:
 *                        - 0 : Do not wait (asynchronous mode).
 *                        - 1 : Wait for the busy flag to clear (synchronous mode).
 *
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation failed due to timeout.
 *
 * @note       This function checks the busy status of the SPIM controller. If @p u32IsSync is set,
 *             it will poll the busy flag until cleared or timeout occurs.
 */
int32_t SPIM_WaitOpDone(SPIM_T *spim, uint32_t u32IsSync)
{
    volatile int32_t i32TimeOutCount = (int32_t)SPIM_TIMEOUT;

    /* Trigger SPIM operation. */
    SPIM_SET_GO(spim);

    if (u32IsSync)
    {
        /* Wait Busy Status. */
        while (SPIM_IS_BUSY(spim))
        {
            if (--i32TimeOutCount <= 0)
            {
                /* Time-out, return failed. */
                return SPIM_ERR_TIMEOUT;
            }
        }
    }

    return SPIM_OK;
}

/**
 * @brief      Issues a Write Enable or Write Disable command to the SPI Flash device.
 *
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn   Specify whether to enable or disable write operations:
 *                       - \ref SPIM_OP_ENABLE : Send Write Enable command (e.g., 0x06)
 *                       - \ref SPIM_OP_DISABLE: Send Write Disable command (e.g., 0x04)
 * @param[in]  u32NBit   SPI bus I/O width (bit mode):
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit mode
 *
 * @return     None.
 *
 * @note       This command is typically required before performing write, erase, or security register operations.
 */
void SPIM_SetWriteEnable(SPIM_T *spim, int32_t i32IsEn, uint32_t u32NBit)
{
    /* 1-byte Write Enable command. */
    uint8_t au8CmdBuf[2] = {0U, 0U};

    au8CmdBuf[0] = (i32IsEn ? OPCODE_WREN : OPCODE_WRDI);
    au8CmdBuf[1] = (i32IsEn ? OPCODE_WREN : OPCODE_WRDI);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);

    /* CS activated.   */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

