OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_ENABLE);
}

/**
 * @brief      Enable or disable Wrap Around mode on the SPI Flash.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn Specify whether to enable or disable Wrap mode:
 *                     - \ref SPIM_OP_ENABLE  : Enable Wrap Around mode
 *                     - \ref SPIM_OP_DISABLE : Disable Wrap Around mode
 *
 * @retval     SPIM_OK          Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT Operation aborted due to timeout.
 *
 * @note       Wrap Around mode is commonly used to optimize burst read performance
 *             by allowing continuous read within a fixed-length boundary.
 */
int32_t SPIM_SetWrapAroundEnable(SPIM_T *spim, int32_t i32IsEn)
{
    const uint32_t u32CmdBuf[2] = {0x00000000, 0x11011101};
    int32_t i32Ret;
    uint32_t u32Mask;
    uint32_t u32Val;
    uint32_t u32IsQuadEn;

    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, SPIM_BITMODE_1);

    if (u32IsQuadEn == SPIM_OP_DISABLE)
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);
    }

    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    if ((uint32_t)i32IsEn == SPIM_OP_ENABLE)
    {
        u32Mask = (uint32_t)(1UL << 29);
    }
    else
    {
        u32Mask = (uint32_t)(1UL << 28);
    }

    u32Val = u32CmdBuf[0];
    u32Val |= u32Mask;

    spim->TX[0] = u32Val;
    spim->TX[1] = 0x11011101;

    SPIM_SwitchNBitOutput(spim, SPIM_BITMODE_4);

    /* Switch to Normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);

    SPIM_SET_DATA_WIDTH(spim, SPIM_DWIDTH_32);
    SPIM_SET_BURST_DATA(spim, SPIM_BURSTNUM_2);

    i32Ret = SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    return i32Ret;
}

/**
 * @brief      Issue the command to exit continuous read mode on SPI Flash.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 *
 * @retval     0                  Operation completed successfully.
 * @retval     negative value     Operation failed (e.g., due to timeout or invalid configuration).
 *
 * @note       Some SPI Flash devices (e.g., Winbond, Macronix) enter continuous read mode after
 *             specific fast-read commands. This function sends a termination sequence (usually
 *             dummy clocks or specific exit command) to revert back to standby command mode.
 *
 * @note       Refer to the specific flash datasheet to determine if this operation is required.
 */
static int32_t _SPIM_SetContReadDisable(SPIM_T *spim)
{
    int32_t i32Ret;
    uint32_t u32IsQuadEn;

    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, SPIM_BITMODE_1);

    if (u32IsQuadEn == SPIM_OP_DISABLE)
    {
        SPIM_SetQuadEnable(spim, SPIM_OP_ENABLE, SPIM_BITMODE_1);
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    spim->TX[0] = 0xFFFFFFFFUL;

    /* Quad output mode */
    SPIM_SwitchNBitOutput(spim, SPIM_BITMODE_4);

    /* Switch to normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
    SPIM_SET_DATA_WIDTH(spim, SPIM_DWIDTH_32);
    SPIM_SET_BURST_DATA(spim, SPIM_BURSTNUM_1);

    i32Ret = SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    _SPIM_ClearContReadPhase(spim, SPIM_CTL0_OPMODE_DIRECTMAP);

    return SPIM_OK;
}

/**
 * @brief      Synchronize the 4-byte address mode state between the SPIM controller and the SPI Flash device.
 * @param[in]  spim           Pointer to the SPIM peripheral instance.
 * @param[in]  u32Is4ByteAddr Specify whether to enable (1) or disable (0) 4-byte address mode.
 * @param[in]  u32CmdBit      Bit mode used for the command transmission
 *                            - \ref SPIM_BITMODE_1 : 1-bit mode
 *                            - \ref SPIM_BITMODE_2 : 2-bit (Dual) mode
 *                            - \ref SPIM_BITMODE_4 : 4-bit (Quad) mode
 *                            - \ref SPIM_BITMODE_8 : 8-bit (Octal) mode
 * @return     SPIM_OK on success, or an error code on failure.
 *
 * @note       This function ensures that the SPIM controller's 4-byte address mode setting
 *             matches the SPI Flash device's mode by sending the appropriate command
 *             (EN4B or EX4B) if a change is needed.
 *
 */
static int32_t _SPIM_Sync4ByteAddrMode(SPIM_T *spim, uint32_t u32Is4ByteAddr, uint32_t u32CmdBit)
{
    uint32_t u32Flash4BState = SPIM_Is4ByteModeEnable(spim, u32CmdBit);

    /* If the current state is the same, skip resending EN4B/EX4B to avoid redundant commands */
    if (u32Flash4BState != u32Is4ByteAddr)
    {
        int32_t i32Ret = SPIM_Enable_4Bytes_Mode(spim, u32Is4ByteAddr, u32CmdBit);

        if (i32Ret != SPIM_OK)
        {
            return i32Ret;
        }
    }

    /* Sync SPIM mode only after flash-side state is confirmed or unchanged. */
    SPIM_SET_4BYTE_ADDR(spim, u32Is4ByteAddr);

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief      Exit Infineon Octal I/O (OPI) mode and revert to legacy 1S-1S-1S SPI mode.

 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 *
 * @note       After this operation, all future communication with the flash device should use
 *             standard SPI commands. Make sure the controller SPI configuration is reverted
 *             accordingly (e.g., bit width, clock polarity).
 */
void SPIM_ExitOPIMode_IFX(SPIM_T *spim)
{
    uint8_t u8CFR5Buf = 0xFFU;
    volatile uint32_t u32Delay = 0;

    // === Phase A: Try accessing CFR5V using Octal DDR (8D-8D-8D) ===
    SPIM_PHASE_T sPhase8D =
    {
        .u32CMDCode = OPCODE_IFX_RD_VCR,
        .u32CMDPhase = PHASE_OCTAL_MODE, .u32CMDWidth = PHASE_WIDTH_8, .u32CMDDTR = PHASE_ENABLE_DTR,
        .u32AddrPhase = PHASE_OCTAL_MODE, .u32AddrWidth = PHASE_WIDTH_32, .u32AddrDTR = PHASE_ENABLE_DTR,
        .u32DataPhase = PHASE_OCTAL_MODE, .u32ByteOrder = PHASE_ORDER_MODE0, .u32DataDTR = PHASE_ENABLE_DTR,
        .u32RDQS = SPIM_OP_DISABLE, .u32DcNum = 8
    };
    SPIM_PHASE_T sWrite8D = sPhase8D;
    SPIM_PHASE_T sPhase8S = {0};
    SPIM_PHASE_T sWrite8S = {0};

    sWrite8D.u32CMDCode = OPCODE_IFX_WR_VCR;
    sWrite8D.u32DcNum = 0;

    SPIM_SetupConfigRegDiv(spim, SPIM_OP_DISABLE);
    SPIM_IO_ReadByPhase(spim, &sPhase8D, IFX_CFR5_ADDR, &u8CFR5Buf, 1);

