OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    switch (au8IdBuf[0])
    {
        /* Winbond SPI flash */
        case MFGID_WINBOND:
        {
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

            u32IsQuadMode = ((dataBuf[1] & SR2_QE) != 0U) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;

            break;
        }

        case MFGID_MXIC:
        case MFGID_EON:
        case MFGID_ISSI:
            SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
            u32IsQuadMode = ((dataBuf[0] & SR_QE) != 0U) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
            break;

        case MFGID_SPANSION:
            _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
            u32IsQuadMode = ((dataBuf[1] & SR2_QE) != 0U) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
            break;

        default:
            break;
    }

    return u32IsQuadMode;
}

/**
 * @brief      Enable or disable QPI (Quad Peripheral Interface) mode.
 *
 * @param[in]  spim    Pointer to the SPIM peripheral instance.
 * @param[in]  i32IsEn Set to 1 to enable QPI mode, or 0 to disable it.
 *                     - \ref SPIM_OP_ENABLE  : Enable QPI mode
 *                     - \ref SPIM_OP_DISABLE : Disable QPI mode
 * @return     None
 */
static void _SPIM_EonSetQpiMode(SPIM_T *spim, int32_t i32IsEn)
{
    /* 1-byte command.  */
    uint8_t au8CmdBuf[1];
    uint8_t au8Status[1];

    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), SPIM_BITMODE_1);
    SPIM_DBGMSG("Status: 0x%x\n", au8Status[0]);

    if (i32IsEn)
    {
        /* Assume in SPI mode. */
        au8CmdBuf[0] = OPCODE_ENQPI;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        (void)_SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

        /* CS deactivated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    }
    else
    {
        /* Assume in QPI mode. */
        au8CmdBuf[0] = OPCODE_EXQPI;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        (void)_SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_4);

        /* CS deactivated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
    }

    SPIM_ReadStatusRegister(spim, au8Status, sizeof(au8Status), 1UL);
    SPIM_DBGMSG("Status: 0x%x\n", au8Status[0]);
}

/**
 * @brief      Enable or disable 4-byte address mode for Spansion SPI Flash.
 * @param[in]  spim     Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsEn  Enable or disable 4-byte address mode.
 *                      - \ref SPIM_OP_ENABLE
 *                      - \ref SPIM_OP_DISABLE
 * @param[in]  u32NBit  Bit mode used for command transmission.
 *                      - \ref SPIM_BITMODE_1 : 1-bit mode
 *                      - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                      - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                      - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None
 */
static void _SPIM_SPANSION4BytesEnable(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit)
{
    uint8_t au8CmdBuf[2];
    uint8_t au8DataBuf[1];

    au8CmdBuf[0] = OPCODE_BRRD;

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, 1UL, u32NBit);

    (void)_SPIM_ReadData(spim, au8DataBuf, 1UL, SPIM_BITMODE_1);

    /* CS deactivated.  */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_DBGMSG("Bank Address register= 0x%x\n", au8DataBuf[0]);

    au8CmdBuf[0] = OPCODE_BRWR;

    if (u32IsEn)
    {
        /* set EXTADD */
        au8CmdBuf[1] = au8DataBuf[0] | 0x80U;
    }
    else
    {
        /* clear EXTADD */
        au8CmdBuf[1] = au8DataBuf[0] & ~0x80U;
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, au8CmdBuf, sizeof(au8CmdBuf), SPIM_BITMODE_1);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}

/** @cond HIDDEN_SYMBOLS */
/**
 * @brief      Query whether 4-byte address mode is enabled.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     0         4-byte address mode is disabled.
 * @retval     1         4-byte address mode is enabled.
 */
uint32_t SPIM_Is4ByteModeEnable(SPIM_T *spim, uint32_t u32NBit)
{
    uint32_t isEn = 0;
    uint8_t idBuf[3];
    uint8_t dataBuf[2];

    (void)memcpy(idBuf, gau8IDBuf, sizeof(idBuf));

    switch (idBuf[0])
    {
        case MFGID_WINBOND:
            _SPIM_ReadStatusRegister3(spim, dataBuf, sizeof(dataBuf), u32NBit);

            /* Before MX25L6406E, bit 6 of Status Register-3 is reserved. */
            //isEn = (idBuf[2] < 0x16U) ? !(int32_t)SPIM_OP_ENABLE : !!(dataBuf[0] & SR3_ADR);
            if (idBuf[2] < 0x16U)
            {
                /* Old device: bit reserved → treat as "not enabled". */
                isEn = (int32_t)SPIM_OP_DISABLE;
            }
            else
            {
                if ((dataBuf[0] & SR3_ADR) != 0U)
                {
                    isEn = (int32_t)SPIM_OP_ENABLE;
                }
                else
                {
                    isEn = (int32_t)SPIM_OP_DISABLE;
                }
            }

            break;

        case MFGID_MXIC:
        case MFGID_EON:
            _SPIM_ReadSecurityRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);

            /* Before MT25QL512ABA, bit 4 of Security Register is reserved. */
            //isEn = (idBuf[2] < 0x19U) ? !(int32_t)SPIM_OP_ENABLE : !!(dataBuf[0] & SCUR_4BYTE);
            if (idBuf[2] < 0x19U)
            {
                isEn = (int32_t)SPIM_OP_DISABLE;
            }
            else
            {
                if ((dataBuf[0] & SCUR_4BYTE) != 0U)
                {
                    isEn = (int32_t)SPIM_OP_ENABLE;
                }
                else
                {
                    isEn = (int32_t)SPIM_OP_DISABLE;
                }
            }

            break;

