OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
        case MFGID_ISSI:

            /* Before IS25LP016D, 4-byte address mode supported. */
            //isEn = (idBuf[2] < 0x49U) ? (int32_t)SPIM_OP_DISABLE : (int32_t)SPIM_OP_ENABLE;
            if (idBuf[2] < 0x49U)
            {
                isEn = (int32_t)SPIM_OP_DISABLE;
            }
            else
            {
                isEn = (int32_t)SPIM_OP_ENABLE;
            }

            break;

        case MFGID_MICRON:
            /* Before MT35XL01G1AA, bit 6 of Flag Register is reserved. */
            _SPIM_ReadMT35xFlagRegister(spim, dataBuf, sizeof(dataBuf), u32NBit);

            // isEn = !!(dataBuf[0] & SR3_ADR);
            if ((dataBuf[0] & SR3_ADR) != 0U)
            {
                isEn = (int32_t)SPIM_OP_ENABLE;
            }
            else
            {
                isEn = (int32_t)SPIM_OP_DISABLE;
            }

            break;

        default:
            break;
    }

    return isEn;
}

/** @endcond HIDDEN_SYMBOLS  */

/**
 * @brief      Enter or exit 4-byte address mode on the SPI Flash device.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32IsEn   Enable or disable 4-byte address mode.
 *                       - \ref SPIM_OP_ENABLE  : Enter 4-byte address mode
 *                       - \ref SPIM_OP_DISABLE : Exit 4-byte address mode
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @retval     SPIM_OK         Operation completed successfully.
 * @retval     SPIM_ERR_FAIL   Operation failed (e.g., unsupported command or communication error).
 */
int32_t SPIM_Enable_4Bytes_Mode(SPIM_T *spim, uint32_t u32IsEn, uint32_t u32NBit)
{
    int32_t i32IsSupt = 0L;
    int32_t i32Ret = SPIM_ERR_FAIL;
    uint8_t au8IdBuf[3];

    SPIM_ReadJedecId(spim, au8IdBuf, sizeof(au8IdBuf), u32NBit);

    /* Based on Flash size, check if 4-byte address mode is supported. */
    switch (au8IdBuf[0])
    {
        case MFGID_WINBOND:
            i32IsSupt = (au8IdBuf[2] < 0x16U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_MXIC:
        case MFGID_EON:
            i32IsSupt = (au8IdBuf[2] < 0x19U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_ISSI:
            i32IsSupt = (au8IdBuf[2] < 0x49U) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;
            break;

        case MFGID_SPANSION:
            _SPIM_SPANSION4BytesEnable(spim, u32IsEn, u32NBit);
            i32IsSupt = SPIM_OP_ENABLE;
            i32Ret = SPIM_OK;
            break;

        case MFGID_MICRON:
            //SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);
            i32IsSupt = SPIM_OP_ENABLE;
            break;

        default:
            break;
    }

    if ((i32IsSupt) && (au8IdBuf[0] != (uint8_t)MFGID_SPANSION))
    {
        /* 1-byte Enter/Exit 4-Byte Mode command. */
        uint8_t u8CmdBuf[2];
        uint8_t u8Opcode = (u32IsEn != 0U) ? OPCODE_EN4B : OPCODE_EX4B;

        u8CmdBuf[0] = u8Opcode;
        u8CmdBuf[1] = u8Opcode;

        /* CS activated. */
        SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

        (void)_SPIM_WriteData(spim, u8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

        /* CS deactivated.  */
        SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

        /*
         * FIXME: Per test, 4BYTE Indicator bit doesn't set after EN4B, which
         * doesn't match spec(MX25L25635E), so skip the check below.
         */
        i32Ret = SPIM_OK;

        if (au8IdBuf[0] != (uint8_t)MFGID_MXIC)
        {
            /*
             *  About over 100 instrucsions executed, just want to give
             *  a time-out about 1 seconds to avoid infinite loop
             */
            volatile int32_t i32TimeOutCount = (SystemCoreClock) / 100U;

            while ((--i32TimeOutCount >= 0) && ((uint32_t)SPIM_Is4ByteModeEnable(spim, u32NBit) != u32IsEn)) {}

            if (i32TimeOutCount <= 0L)
            {
                i32Ret = SPIM_ERR_FAIL;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief      Unlock Winbond flash chip with security bit enabled.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @return     None.
 * @note       This function issues the Winbond-specific unlock sequence
 *             to disable security features and allow full chip access.
 */
void SPIM_WinbondUnlock(SPIM_T *spim, uint32_t u32NBit)
{
    uint8_t au8IdBuf[3];
    uint8_t dataBuf[4];

    SPIM_ReadJedecId(spim, au8IdBuf, sizeof(au8IdBuf), u32NBit);

    if ((au8IdBuf[0] != (uint8_t)MFGID_WINBOND) ||
            (au8IdBuf[1] != 0x40U) ||
            (au8IdBuf[2] != 0x16U))
    {
        SPIM_DBGMSG("SPIM_WinbondUnlock - Not W25Q32, do nothing.\n");
        return;
    }

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register: 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);

    /* clear Status Register-1 SEC bit */
    dataBuf[1] &= ~0x40;

    /* Write Enable.    */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);
    _SPIM_WriteStatusRegister2(spim, dataBuf, sizeof(dataBuf), u32NBit);
    (void)_SPIM_WaitWriteDone(spim, u32NBit);

    SPIM_ReadStatusRegister(spim, &dataBuf[0], 1UL, u32NBit);
    _SPIM_ReadStatusRegister2(spim, &dataBuf[1], 1UL, u32NBit);
    SPIM_DBGMSG("Status Register (after unlock): 0x%x - 0x%x\n", dataBuf[0], dataBuf[1]);
}

/**
 * @brief      Erase the entire SPI flash chip.
 * @param[in]  spim      Pointer to the SPIM peripheral instance.
 * @param[in]  u32NBit   Bit mode used for command transmission.
 *                       - \ref SPIM_BITMODE_1 : 1-bit mode
 *                       - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                       - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                       - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @param[in]  i32IsSync Whether to wait until the erase operation is completed.
 *                       - 1: Wait (blocking mode)
 *                       - 0: Return immediately (non-blocking)
 * @return     None.
 * @note       The chip erase operation may take several seconds to complete.
 *             Ensure the flash is write-enabled before calling this function.
 */
void SPIM_ChipErase(SPIM_T *spim, uint32_t u32NBit, int32_t i32IsSync)
{
    /* 1-byte Chip Erase command. */
    const uint8_t cmdBuf[2] = {OPCODE_CHIP_ERASE, OPCODE_CHIP_ERASE};

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

