OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    (void)_SPIM_WriteData(spim, cmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (i32IsSync)
    {
        (void)_SPIM_WaitWriteDone(spim, u32NBit);
    }
}

/**
 * @brief      Erase a specific block in SPI flash memory.
 * @param[in]  spim            Pointer to the SPIM peripheral instance.
 * @param[in]  u32Addr         Target address within the block to erase.
 * @param[in]  u32Is4ByteAddr  Whether the flash uses a 4-byte address.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32ErsCmd       Block erase command opcode.
 *                             - \ref OPCODE_SE_4K  : Sector Erase 4KB
 *                             - \ref OPCODE_BE_32K : Block Erase 32KB
 *                             - \ref OPCODE_BE_64K : Block Erase 64KB
 * @param[in]  u32NBit         Bit mode used for transmission.
 *                             - \ref SPIM_BITMODE_1 : 1-bit mode
 *                             - \ref SPIM_BITMODE_2 : 2-bit (dual) mode
 *                             - \ref SPIM_BITMODE_4 : 4-bit (quad) mode
 *                             - \ref SPIM_BITMODE_8 : 8-bit (octal) mode
 * @param[in]  i32IsSync       Whether to wait for the erase to complete.
 *                             - 1: Wait until erase is complete (blocking mode)
 *                             - 0: Return immediately (non-blocking mode)
 * @return     None.
 * @note       Ensure the flash is write-enabled before calling this function.
 *             The erase command will affect the entire block that contains the given address.
 */
void SPIM_EraseBlock(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32ErsCmd, uint32_t u32NBit, int32_t i32IsSync)
{
    uint8_t cmdBuf[6] = {0};
    uint32_t buf_idx = 0UL;
    uint32_t u32Is4ByteAddrTmp = u32Is4ByteAddr;

    cmdBuf[buf_idx] = (uint8_t)u32ErsCmd;
    buf_idx++;

    if ((SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) &&
            (u32NBit == SPIM_BITMODE_8))
    {
        cmdBuf[buf_idx] = (uint8_t)u32ErsCmd;
        buf_idx++;
        u32Is4ByteAddrTmp = SPIM_OP_ENABLE;
    }

    if (u32Is4ByteAddrTmp)
    {
        cmdBuf[buf_idx] = (uint8_t)((u32Addr >> 24U) & 0xFFU);
        buf_idx++;
    }

    cmdBuf[buf_idx] = (uint8_t)((u32Addr >> 16U) & 0xFFU);
    buf_idx++;
    cmdBuf[buf_idx] = (uint8_t)((u32Addr >> 8U) & 0xFFU);
    buf_idx++;
    cmdBuf[buf_idx] = (uint8_t)(u32Addr & 0xFFU);
    buf_idx++;

    /* Enable 4-byte address mode */
    if (_SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddrTmp, u32NBit) != SPIM_OK)
    {
        return;
    }

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBit);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    (void)_SPIM_WriteData(spim, cmdBuf, buf_idx, u32NBit);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (i32IsSync)
    {
        (void)_SPIM_WaitWriteDone(spim, u32NBit);
    }
}


/** @cond HIDDEN_SYMBOLS */

/**
 * @brief      Write data within a single page using the specified I/O mode.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Whether to use 4-byte addressing.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to transmit buffer.
 * @param[in]  u8WrCmd        Write command opcode.
 * @param[in]  u32NBitCmd     Bit width for command phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr    Bit width for address phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat     Bit width for data phase.
 *                             - \ref SPIM_BITMODE_1
 *                             - \ref SPIM_BITMODE_2
 *                             - \ref SPIM_BITMODE_4
 *                             - \ref SPIM_BITMODE_8
 * @param[in]  u32IsSync      Whether to wait until operation completes.
 *                             - 1: Blocking mode (wait for write to complete)
 *                             - 0: Non-blocking mode
 * @return     None.
 * @note       The data must not cross a page boundary. Caller must ensure write buffer stays within the same page.
 */
static void _SPIM_WriteInPageDataByIo(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx, const uint8_t pu8TxBuf[], uint8_t u8WrCmd,
                                      uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, uint32_t u32IsSync)
{
    uint8_t au8CmdBuf[16] = {0};
    uint32_t u32BufIdx = 0;

    au8CmdBuf[0] = (uint8_t)u8WrCmd;
    au8CmdBuf[1] = (uint8_t)u8WrCmd;

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, u32NBitCmd);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    (void)_SPIM_WriteData(spim, au8CmdBuf, (SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE) ? 2UL : 1UL, u32NBitCmd);

    u32BufIdx = 0UL;

    if (u32Is4ByteAddr)
    {
        au8CmdBuf[u32BufIdx] = (uint8_t)(u32Addr >> 24U);
        u32BufIdx++;
    }

    au8CmdBuf[u32BufIdx] = (uint8_t)(u32Addr >> 16U);
    u32BufIdx++;
    au8CmdBuf[u32BufIdx] = (uint8_t)(u32Addr >> 8U);
    u32BufIdx++;
    au8CmdBuf[u32BufIdx] = (uint8_t) u32Addr;
    u32BufIdx++;

    /* Write out u32Address. */
    (void)_SPIM_WriteData(spim, au8CmdBuf, u32BufIdx, u32NBitAddr);

    /* Write out data. */
    (void)_SPIM_WriteData(spim, pu8TxBuf, u32NTx, u32NBitDat);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    if (u32IsSync)
    {
        (void)_SPIM_WaitWriteDone(spim, u32NBitCmd);
    }
}

/**
 * @brief      Write data within a single page using Page Write mode.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Whether to use 4-byte addressing.
 *                             - 0: 3-byte address mode
 *                             - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to transmit buffer.
 * @param[in]  u8WrCmd        Write command opcode.
 * @param[in]  u32IsSync         Whether to wait for the write to complete.
 *                             - 1: Blocking mode (wait for completion)
 *                             - 0: Non-blocking mode
 * @retval     SPIM_OK           Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT  Operation aborted due to timeout.
 * @note       If a timeout occurs while waiting for the operation to complete,
 *             this function sets @ref g_SPIM_i32ErrCode to @ref SPIM_TIMEOUT_ERR.
 * @warning    The write must not cross a page boundary. Caller is responsible for ensuring data fits within one page.
 */
static int32_t _SPIM_WriteInPageDataByPageWrite(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx,
                                                const uint8_t pu8TxBuf[], uint8_t u8WrCmd, uint32_t u32IsSync)
{
    int32_t i32Ret;
    uintptr_t uSramAddr;
    uint32_t u32WrCmdCode;
    uint32_t u32Target4B = (SPIM_GET_PHDMAW_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;

