OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    i32Ret = _SPIM_ValidateDmaTransfer(u32Addr, pu8TxBuf, u32NTx);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    i32Ret = _SPIM_Validate4ByteAddrMode(u32Is4ByteAddr, u32Target4B);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    uSramAddr = (uintptr_t)pu8TxBuf;

    /* Write Enable. */
    SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    if ((SPIM_GET_PHDMAW_CMD_DTR(spim) == SPIM_OP_ENABLE) &&
            (SPIM_GET_PHDMAW_CMD_WIDTH(spim) == PHASE_WIDTH_16))
    {
        /* Promote to uint32_t BEFORE shifting (MISRA compliant). */
        uint32_t u32Cmd = (uint32_t)u8WrCmd;
        u32WrCmdCode = (u32Cmd << 8U) | u32Cmd;
    }
    else
    {
        u32WrCmdCode = (uint32_t)(u8WrCmd);
    }

    /* Switch to Page Write mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEWRITE);
    /* SPIM mode. */
    SPIM_SET_CMD_CODE(spim, u32WrCmdCode);

    /* SRAM u32Address. */
    spim->SRAMADDR = (uint32_t)uSramAddr;
    /* Transfer length. */
    spim->DMACNT = u32NTx;
    /* Flash u32Address. */
    spim->FADDR = u32Addr;

    i32Ret = SPIM_WaitOpDone(spim, u32IsSync);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    i32Ret = _SPIM_WaitWriteDone(spim, SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim)));

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    if (u8WrCmd == CMD_QUAD_PAGE_PROGRAM_EON)
    {
        /* Exit QPI mode. */
        _SPIM_EonSetQpiMode(spim, 0);
    }

    return SPIM_OK;
}

/** @endcond HIDDEN_SYMBOLS */

/**
 * @brief      Write data to SPI Flash using manual command sequence (I/O mode).
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32Addr      Start address to write.
 * @param[in]  u32Is4ByteAddr
 *                          Specify address mode.
 *                          - 0: 3-byte address mode
 *                          - 1: 4-byte address mode
 * @param[in]  u32NTx       Number of bytes to write.
 * @param[in]  pu8TxBuf     Pointer to the transmit buffer.
 * @param[in]  u8WrCmd      Write command opcode.
 * @param[in]  u32NBitCmd   N-bit mode for transmitting the command.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr  N-bit mode for transmitting the address.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat   N-bit mode for transmitting the data.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @return     None.
 *
 * @note       This function does not check for page boundary crossing. Caller must ensure
 *             data does not span across pages unless supported by the flash chip.
 *
 * @warning    This function assumes that the flash is already write-enabled. Be sure to
 *             call the appropriate Write Enable command before using this function.
 */
void SPIM_IO_Write(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NTx, uint8_t pu8TxBuf[], uint8_t u8WrCmd,
                   uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat)
{
    int32_t i32Ret;
    /* Write out data to SPI Flash in small chunks (max 256 bytes per chunk) */
    /* index into tx buffer */
    uint32_t u32BufIdx = 0UL;
    uint32_t u32NTxTmp = u32NTx;
    uint32_t u32AddrTmp = u32Addr;

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    while (u32NTxTmp)
    {
        /* number of bytes to write in this chunk */
        uint32_t u32ToWr = _SPIM_GetPageChunkSize(u32AddrTmp, u32NTxTmp);

        _SPIM_WriteInPageDataByIo(spim, u32AddrTmp, u32Is4ByteAddr,
                                  u32ToWr, &pu8TxBuf[u32BufIdx], u8WrCmd,
                                  u32NBitCmd, u32NBitAddr, u32NBitDat,
                                  SPIM_OP_ENABLE);
        u32AddrTmp += u32ToWr;
        u32NTxTmp -= u32ToWr;
        u32BufIdx += u32ToWr;
    }
}

/**
 * @brief      Read data from SPI Flash using manual command sequence (I/O mode).
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32Addr      Start address to read.
 * @param[in]  u32Is4ByteAddr
 *                          Specify address mode.
 *                          - 0: 3-byte address mode
 *                          - 1: 4-byte address mode
 * @param[in]  u32NRx       Number of bytes to read.
 * @param[out] pu8RxBuf     Pointer to the receive buffer.
 * @param[in]  rdCmd        Read command opcode.
 * @param[in]  u32NBitCmd   N-bit mode for transmitting the command.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitAddr  N-bit mode for transmitting the address.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NBitDat   N-bit mode for transmitting/receiving data.
 *                          - \ref SPIM_BITMODE_1
 *                          - \ref SPIM_BITMODE_2
 *                          - \ref SPIM_BITMODE_4
 *                          - \ref SPIM_BITMODE_8
 * @param[in]  u32NDummy    Number of dummy cycles (clock cycles) after address phase.
 *
 * @return     None.
 *
 * @note       Caller must ensure that the read command is compatible with the selected bit
 *             modes and that the flash is ready for read operation.
 *
 * @warning    This function does not automatically handle status polling or chip select timing.
 *             Make sure the flash is not busy before calling this function.
 */
void SPIM_IO_Read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr, uint32_t u32NRx, uint8_t pu8RxBuf[], uint8_t rdCmd,
                  uint32_t u32NBitCmd, uint32_t u32NBitAddr, uint32_t u32NBitDat, uint32_t u32NDummy)
{
    uint8_t cmdBuf[8] = {0U, 0U, 0U, 0U, 0U, 0U, 0U, 0U};
    int32_t i32Ret;
    uint32_t buf_idx = 0UL;

    cmdBuf[0] = rdCmd;
    cmdBuf[1] = rdCmd;

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddr, SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim)));

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    (void)_SPIM_WriteData(spim, cmdBuf, SPIM_GET_DTR_MODE(spim) == SPIM_OP_ENABLE ? 2UL : 1UL, u32NBitCmd);

