OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    if (u32Is4ByteAddr)
    {
        cmdBuf[buf_idx] = (uint8_t)(u32Addr >> 24U);
        buf_idx++;
    }

    cmdBuf[buf_idx] = (uint8_t)(u32Addr >> 16U);
    buf_idx++;
    cmdBuf[buf_idx] = (uint8_t)(u32Addr >> 8U);
    buf_idx++;
    cmdBuf[buf_idx] = (uint8_t) u32Addr;
    buf_idx++;

    /* Add a byte for the address phase for dual or quad mode for read mode */
    buf_idx += ((u32NBitAddr == SPIM_BITMODE_2) || (u32NBitAddr == SPIM_BITMODE_4)) ? 1UL : 0UL;

    (void)_SPIM_WriteData(spim, cmdBuf, buf_idx, u32NBitAddr);    /* Write out u32Address. */

    /* Same bit mode as above. */
    (void)SPIM_IO_SendDummyByPhase(spim, u32NDummy);              /* Write out dummy bytes. */

    /* Read back data. */
    (void)_SPIM_ReadData(spim, pu8RxBuf, u32NRx, u32NBitDat);

    /* CS deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Write data to SPI Flash using Page Write mode with PHDMAW.
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32Addr        Start address to write.
 * @param[in]  u32Is4ByteAddr Specify whether 4-byte address mode is used.
 *                            - 0: 3-byte address mode
 *                            - 1: 4-byte address mode
 * @param[in]  u32NTx         Number of bytes to write.
 * @param[in]  pu8TxBuf       Pointer to the transmit buffer.
 * @param[in]  u8WrCmd        Write command opcode.
 *
 * @note       This function is optimized for aligned and page-boundary write operations.
 *             Make sure that the flash is write-enabled and ready before calling this function.
 *             The number of bytes to write must be a multiple of 8 (for DMA alignment).
 */
void SPIM_DMA_Write(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr,
                    uint32_t u32NTx, uint8_t *pu8TxBuf, uint32_t u8WrCmd)
{
    int32_t i32Ret;
    /* index into tx buffer */
    uint32_t u32BufIdx = 0UL;
    uint32_t u32NTxTmp = u32NTx;
    uint32_t u32AddrTmp = u32Addr;
    uint32_t u32CMDBits = SPIM_PhaseModeToNBit(SPIM_GET_PHDMAW_CMD_BITMODE(spim));
    uint32_t u32Target4B = (SPIM_GET_PHDMAW_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    uint32_t u32IsQuadEn;
    uint32_t u32QuadMode = (((SPIM_GET_PHDMAW_ADDR_BITMODE(spim) == PHASE_QUAD_MODE) ||
                             (SPIM_GET_PHDMAW_DATA_BITMODE(spim) == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    i32Ret = _SPIM_ValidateDmaTransfer(u32Addr, pu8TxBuf, u32NTx);

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    i32Ret = _SPIM_Validate4ByteAddrMode(u32Is4ByteAddr, u32Target4B);

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CMDBits);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Target4B, u32CMDBits);

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CMDBits);
    }

    while (u32NTxTmp)
    {
        /* number of bytes to write in this chunk */
        uint32_t u32ToWr = _SPIM_GetPageChunkSize(u32AddrTmp, u32NTxTmp);

        i32Ret = _SPIM_WriteInPageDataByPageWrite(spim, u32AddrTmp, u32Is4ByteAddr, u32ToWr, &pu8TxBuf[u32BufIdx], u8WrCmd, SPIM_OP_ENABLE);

        if (i32Ret != SPIM_OK)
        {
            return;
        }

        /* Advance indicator. */
        u32AddrTmp += u32ToWr;
        u32NTxTmp -= u32ToWr;
        u32BufIdx += u32ToWr;
    }
}

/**
 * @brief      Read data from SPI Flash using Page Read mode with PHDMAR.
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32Addr        Start address to read.
 * @param[in]  u32Is4ByteAddr Specify whether 4-byte address mode is used.
 *                            - 0: 3-byte address mode
 *                            - 1: 4-byte address mode
 * @param[in]  u32NRx         Number of bytes to read.
 * @param[out] pu8RxBuf       Pointer to the receive buffer.
 * @param[in]  u8RdCmd        Read command opcode.
 * @param[in]  u32IsSync      Specify whether to use blocking mode.
 *                            - 0: Non-blocking (return immediately)
 *                            - 1: Blocking (wait for completion)
 *
 * @retval     SPIM_OK            Operation completed successfully.
 * @retval     SPIM_ERR_TIMEOUT   Operation failed due to timeout.
 *
 * @note       Before calling this API, you must initialize the read phase by calling
 *             @ref SPIM_DMADMM_InitPhase with appropriate settings for PHDMAR (Page High-Speed DMA Read).
 */
int32_t SPIM_DMA_Read(SPIM_T *spim, uint32_t u32Addr, uint32_t u32Is4ByteAddr,
                      uint32_t u32NRx, const uint8_t pu8RxBuf[], uint8_t u8RdCmd,
                      uint32_t u32IsSync)
{
    int32_t i32Ret;
    uintptr_t uSramAddr;
    uint32_t u32Is4ByteAddrTmp = (SPIM_GET_PHDMAR_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    uint32_t u32RdCmdTmp;
    uint32_t u32CMDBits = SPIM_PhaseModeToNBit(SPIM_GET_PHDMAR_CMD_BITMODE(spim));
    uint32_t u32IsQuadEn;
    uint32_t u32QuadMode = (((SPIM_GET_PHDMAR_ADDR_BITMODE(spim) == PHASE_QUAD_MODE) ||
                             (SPIM_GET_PHDMAR_DATA_BITMODE(spim) == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    i32Ret = _SPIM_ValidateDmaTransfer(u32Addr, pu8RxBuf, u32NRx);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    i32Ret = _SPIM_Validate4ByteAddrMode(u32Is4ByteAddr, u32Is4ByteAddrTmp);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    uSramAddr = (uintptr_t)pu8RxBuf;

    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CMDBits);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddrTmp, u32CMDBits);

    if (i32Ret != SPIM_OK)
    {
        return i32Ret;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CMDBits);
    }

    if ((SPIM_GET_PHDMAR_MODE_DATAWIDTH(spim) != PHASE_WIDTH_0) &&
            (_SPIM_IsCrenAllowed(u8RdCmd) == SPIM_OP_ENABLE))
    {
        SPIM_SET_MODE_DATA(spim, SPIM_DMM_ENABLE_CREN);
        //SPIM_ENABLE_DMM_CREN(spim);
    }

    if ((SPIM_GET_PHDMAR_CMD_DTR(spim) == SPIM_OP_ENABLE) &&
            (SPIM_GET_PHDMAR_CMD_WIDTH(spim) == PHASE_WIDTH_16))
    {
        /* Promote to uint32_t BEFORE shifting (MISRA compliant). */
        uint32_t u32Cmd = (uint32_t)u8RdCmd;
        u32RdCmdTmp = (u32Cmd << 8U) | u32Cmd;
    }
    else
    {
        u32RdCmdTmp = (uint32_t)(u8RdCmd);
    }

    /* Switch to Page Read mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_PAGEREAD);
    /* SPIM mode. */
    SPIM_SET_CMD_CODE(spim, u32RdCmdTmp);

    /* SRAM u32Address. */
    spim->SRAMADDR = (uint32_t)uSramAddr;
    /* Transfer length. */
    spim->DMACNT = u32NRx;
    /* Flash u32Address. */
    spim->FADDR = u32Addr;

    return SPIM_WaitOpDone(spim, u32IsSync);
}

/**
 * @brief      Enter Direct Map Mode (DMM) for memory-mapped SPI Flash access.
 *
 * @param[in]  spim            Pointer to the SPIM instance.
 * @param[in]  u32Is4ByteAddr  Specify whether 4-byte address mode is used.
 *                             - 0: Use 3-byte address mode.
 *                             - 1: Use 4-byte address mode.
 * @param[in]  u8RdCmd         SPI Flash read command used in DMM mode (e.g., 0x0B, 0x6B, 0xEB).
 * @param[in]  u32IdleIntvl    Idle interval between transactions, in SPIM clock cycles.
 *
 * @return     None.
 *
 * @note       Before entering DMM, ensure the Flash is ready and in the correct mode
 *             (e.g., QSPI, DTR). The command should match the expected Flash read protocol.
 */
void SPIM_EnterDirectMapMode(SPIM_T *spim, uint32_t u32Is4ByteAddr, uint8_t u8RdCmd, uint32_t u32IdleIntvl)
{
    int32_t i32Ret;
    uint32_t u32RdCmdTmp;
    uint32_t u32CMDBits = SPIM_PhaseModeToNBit(SPIM_GET_PHDMM_CMD_BITMODE(spim));
    uint32_t u32Is4ByteAddrTmp = (SPIM_GET_PHDMM_ADDR_WIDTH(spim) == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE;
    uint32_t u32IsQuadEn;
    uint32_t u32QuadMode = (((SPIM_GET_PHDMM_ADDR_BITMODE(spim) == PHASE_QUAD_MODE) ||
                             (SPIM_GET_PHDMM_DATA_BITMODE(spim) == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

