OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    i32Ret = _SPIM_Validate4ByteAddrMode(u32Is4ByteAddr, u32Is4ByteAddrTmp);

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CMDBits);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddrTmp, u32CMDBits);

    if (i32Ret != SPIM_OK)
    {
        return;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CMDBits);
    }

    if ((SPIM_GET_PHDMM_MODE_DATAWIDTH(spim) != PHASE_WIDTH_0) &&
            (_SPIM_IsCrenAllowed(u8RdCmd) == SPIM_OP_ENABLE))
    {
        SPIM_SET_MODE_DATA(spim, SPIM_DMM_ENABLE_CREN);
        SPIM_ENABLE_DMM_CREN(spim);
    }

    if ((SPIM_GET_PHDMM_CMD_WIDTH(spim) == PHASE_WIDTH_16) &&
            (SPIM_GET_PHDMM_CMD_DTR(spim) == SPIM_OP_ENABLE))
    {
        /* Promote to uint32_t BEFORE shifting (MISRA compliant). */
        uint32_t u32Cmd = (uint32_t)u8RdCmd;
        u32RdCmdTmp = (u32Cmd << 8U) | u32Cmd;
    }
    else
    {
        u32RdCmdTmp = (uint32_t)(u8RdCmd);
    }

    /* SPIM mode. */
    SPIM_SET_CMD_CODE(spim, u32RdCmdTmp);
    /* Idle interval. */
    SPIM_SET_IDL_INTVL(spim, u32IdleIntvl);
    /* Switch to Direct Map mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_DIRECTMAP);
}

/**
 * @brief      Exit Direct Map Mode (DMM).
 * @param[in]  spim    Pointer to the SPIM instance.
 * @return     None.
 * @note       Call this function before switching to normal command-based access mode.
 */
void SPIM_ExitDirectMapMode(SPIM_T *spim)
{
    if (SPIM_GET_DMM_BWEN(spim) == SPIM_OP_ENABLE)
    {
        (void)SPIM_SetWrapAroundEnable(spim, 0UL);
    }

    if (SPIM_GET_MODE_DATA(spim) == SPIM_DMM_ENABLE_CREN)
    {
        (void)_SPIM_SetContReadDisable(spim);
    }
}

/**
 * @brief      Convert I/O phase mode to bit width size.
 *
 * @param[in]  u32Phase  I/O phase mode.
 *                       - \ref PHASE_NORMAL_MODE : 1-bit mode
 *                       - \ref PHASE_DUAL_MODE   : 2-bit mode
 *                       - \ref PHASE_QUAD_MODE   : 4-bit mode
 *
 * @return     Bit width of the specified phase mode (1, 2, or 4).
 */
uint32_t SPIM_PhaseModeToNBit(uint32_t u32Phase)
{
    return ((u32Phase == PHASE_NORMAL_MODE) ? SPIM_BITMODE_1 :
            (u32Phase == PHASE_DUAL_MODE) ? SPIM_BITMODE_2 :
            (u32Phase == PHASE_QUAD_MODE) ? SPIM_BITMODE_4 :
            (u32Phase == PHASE_OCTAL_MODE) ? SPIM_BITMODE_8 :
            SPIM_BITMODE_1);
}

/**
 * @brief      Get the address of the DMA/DMM Phase Setting Register based on operation mode.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[in]  u32OPMode   SPI functional operation mode.
 *                         - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode (PHDMAW)
 *                         - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode  (PHDMAR)
 *                         - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode (PHDMM)
 *
 * @return     Register address of the corresponding DMA/DMM phase setting.
 */
static volatile uint32_t *_SPIM_SwitchPhaseRegister(SPIM_T *spim, uint32_t u32OPMode)
{
    volatile uint32_t *pu32Addr;

    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEWRITE)
    {
        pu32Addr = &spim->PHDMAW;
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        pu32Addr = &spim->PHDMAR;
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        pu32Addr = &spim->PHDMM;
    }
    else
    {
        pu32Addr = (volatile uint32_t *)NULL;
    }

    return pu32Addr;
}

/**
 * @brief      Set the command phase configuration for DMA or Direct Map operation.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[in]  u32OPMode   SPI operation mode.
 *                         - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                         - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                         - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit     Command bit mode.
 *                         - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                         - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                         - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                         - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32Width    Command width.
 *                         - \ref PHASE_WIDTH_8     : 8-bit command
 *                         - \ref PHASE_WIDTH_16    : 16-bit command
 *                         - \ref PHASE_WIDTH_24    : 24-bit command
 *                         - \ref PHASE_WIDTH_32    : 32-bit command
 * @param[in]  u32DTREn    Enable or disable DTR (Double Transfer Rate) mode.
 *                         - SPIM_OP_DISABLE : Disable DTR
 *                         - SPIM_OP_ENABLE  : Enable DTR
 *
 * @return     None.
 */
static int32_t _SPIM_SetCMDPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    volatile uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == (uint32_t *)NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Command phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_CMD_Pos);

    *pu32PhaseReg |= ((u32Width << SPIM_PHDMAW_DW_CMD_Pos) |
                      (u32DTREn << SPIM_PHDMAR_DTR_CMD_Pos) |
                      (u32NBit << SPIM_PHDMAW_BM_CMD_Pos));

    return SPIM_OK;
}

/**
 * @brief      Set the address phase configuration for DMA or Direct Map operation.
 *
 * @param[in]  spim        Pointer to the SPIM instance.
 * @param[in]  u32OPMode   SPI operation mode.
 *                         - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                         - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                         - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit     Address bit mode.
 *                         - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                         - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                         - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                         - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32Width    Address width.
 *                         - \ref PHASE_WIDTH_8     : 8-bit address
 *                         - \ref PHASE_WIDTH_16    : 16-bit address
 *                         - \ref PHASE_WIDTH_24    : 24-bit address
 *                         - \ref PHASE_WIDTH_32    : 32-bit address
 * @param[in]  u32DTREn    Enable or disable DTR (Double Transfer Rate) mode.
 *                         - 0: Disable DTR
 *                         - 1: Enable DTR
 *
 * @retval     SPIM_OK          Address phase configured successfully.
 * @retval     SPIM_ERR_FAIL    Invalid parameters or unsupported configuration.
 */
static int32_t _SPIM_SetAddrPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32DTREn)
{
    volatile uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

