OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    if (pu32PhaseReg == (uint32_t *)NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Address phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_ADDR_Pos);

    *pu32PhaseReg |= ((u32Width << SPIM_PHDMAW_DW_ADDR_Pos) |
                      (u32NBit << SPIM_PHDMAW_BM_ADDR_Pos) |
                      (u32DTREn << SPIM_PHDMAR_DTR_ADDR_Pos));

    return SPIM_OK;
}


static void _SPIM_ClearContReadPhase(SPIM_T *spim, uint32_t u32OPMode)
{
    volatile uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);
}

/**
 * @brief      Set the Continue Read phase for DMA or Direct Map operation.
 *
 * @param[in]  spim       Pointer to the SPIM instance.
 * @param[in]  u32OPMode  SPI operation mode.
 *                        - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                        - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit    Bit mode used to transmit continue read command.
 *                        - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                        - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                        - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                        - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32Width   Command width.
 *                        - \ref PHASE_WIDTH_8     : 8-bit command
 *                        - \ref PHASE_WIDTH_16    : 16-bit command
 *                        - \ref PHASE_WIDTH_24    : 24-bit command
 *                        - \ref PHASE_WIDTH_32    : 32-bit command
 * @param[in]  u32ContEn  Enable or disable Continue Read mode.
 *                        - \ref PHASE_ENABLE_CONT_READ    : Enable Continue Read mode
 *                        - \ref PHASE_DISABLE_CONT_READ   : Disable Continue Read mode
 * @param[in]  u32DTREn   Enable or disable DTR (Double Transfer Rate) mode.
 *                        - 0: Disable DTR
 *                        - 1: Enable DTR
 *
 * @retval     SPIM_OK          Continue Read phase set successfully.
 * @retval     SPIM_ERR_FAIL    Invalid configuration or operation failed.
 */
static int32_t _SPIM_SetContReadPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit, uint32_t u32Width, uint32_t u32ContEn, uint32_t u32DTREn)
{
    volatile uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == (uint32_t *)NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Read Mode phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_READMODE_Pos);

    //if ((u32ContEn == PHASE_ENABLE_CONT_READ) &&
    //        (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP))
    //{
    //    SPIM_ENABLE_DMM_CREN(spim);
    //}

    if ((u32ContEn == PHASE_ENABLE_CONT_READ) &&
            (u32OPMode != SPIM_CTL0_OPMODE_PAGEWRITE))
    {
        *pu32PhaseReg |= ((u32Width << SPIM_PHDMAR_DW_MODE_Pos) |
                          (u32NBit << SPIM_PHDMAR_BM_MODE_Pos) |
                          (u32DTREn << SPIM_PHDMAR_DTR_MODE_Pos));
        /* Enable Contiue Read Mode */
        //SPIM_SET_MODE_DATA(spim, SPIM_DMM_ENABLE_CREN);
    }
    else
    {
        *pu32PhaseReg &= ~(SPIM_PHDMAR_DW_MODE_Msk);
        SPIM_CLEAR_MODE_DATA(spim);
    }

    return SPIM_OK;
}

/**
 * @brief      Set the Data Phase configuration for DMA or Direct Map operation.
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  u32OPMode     SPI operation mode.
 *                           - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                           - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                           - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Map mode
 * @param[in]  u32NBit       Bit mode used during the data phase.
 *                           - \ref PHASE_NORMAL_MODE : Standard mode (1-bit)
 *                           - \ref PHASE_DUAL_MODE   : Dual mode (2-bit)
 *                           - \ref PHASE_QUAD_MODE   : Quad mode (4-bit)
 *                           - \ref PHASE_OCTAL_MODE  : Octal mode (8-bit)
 * @param[in]  u32ByteOrder  Data byte order for Octal SPI Flash during read phase.
 *                           - \ref PHASE_ORDER_MODE0 : {byte0, byte1, byte2, byte3, byte4, byte5, byte6, byte7}
 *                           - \ref PHASE_ORDER_MODE1 : {byte7, byte6, byte5, byte4, byte3, byte2, byte1, byte0}
 *                           - \ref PHASE_ORDER_MODE2 : {byte1, byte0, byte3, byte2, byte5, byte4, byte7, byte6}
 *                           - \ref PHASE_ORDER_MODE3 : {byte6, byte7, byte4, byte5, byte2, byte3, byte0, byte1}
 * @param[in]  u32DTREn      Enable or disable DTR (Double Transfer Rate) mode.
 *                           - \ref SPIM_OP_ENABLE
 *                           - \ref SPIM_OP_DISABLE
 * @param[in]  u32RdDQS      Enable or disable Read DQS (Data Strobe).
 *                           - \ref SPIM_OP_ENABLE
 *                           - \ref SPIM_OP_DISABLE
 *
 * @retval     SPIM_OK       Configuration successful.
 * @retval     SPIM_ERR_FAIL Configuration failed.
 */
static int32_t _SPIM_SetDataPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32NBit,
                                  uint32_t u32ByteOrder, uint32_t u32DTREn, uint32_t u32RdDQS)
{
    volatile uint32_t *pu32PhaseReg = (uint32_t *)_SPIM_SwitchPhaseRegister(spim, u32OPMode);

    if (pu32PhaseReg == (uint32_t *)NULL)
    {
        return SPIM_ERR_FAIL;
    }

    /* clear Data phase setting. */
    *pu32PhaseReg &= ~(0xFFUL << PHASE_CLR_DATA_Pos);

    *pu32PhaseReg |= ((u32RdDQS << SPIM_PHDMAR_RDQS_DATA_Pos)    |
                      (u32DTREn << SPIM_PHDMAR_DTR_DATA_Pos)     |
                      (u32ByteOrder << SPIM_PHDMAW_PBO_DATA_Pos) |
                      (u32NBit << SPIM_PHDMAR_BM_DATA_Pos));

    return SPIM_OK;
}

/**
 * @brief      Initialize command phase settings for DMA/DMM SPI Flash operations.
 *
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  psPhaseTable   Pointer to the command phase table. This table must be
 *                            defined according to the supported command codes of the
 *                            target SPI Flash device.
 * @param[in]  u32OPMode      SPI operation mode:
 *                            - \ref SPIM_CTL0_OPMODE_PAGEWRITE : DMA write mode
 *                            - \ref SPIM_CTL0_OPMODE_PAGEREAD  : DMA read mode
 *                            - \ref SPIM_CTL0_OPMODE_DIRECTMAP : Direct Memory Mapping mode
 * @note  Invoke SPIM_DMADMM_InitPhase before any DMA read, DMA write, or
 *        Direct Map (DMM) access to configure command / address / data phases.
 *
 *        Reinvoke SPIM_DMADMM_InitPhase whenever any of the following change:
 *        - Command opcode
 *        - Operation mode (Page Write, Page Read, Direct Map)
 *
 *        Omitting reinitialization after such changes can lead to transfer
 *        errors or data corruption.
 *
 * @return     None.
 */
void SPIM_DMADMM_InitPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable, uint32_t u32OPMode)
{
    int32_t i32Ret;
    uint32_t u32SavedDTREn = SPIM_GET_DTR_MODE(spim);
    uint32_t u32Is4ByteAddr = 0;
    uint32_t u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                             (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    uint32_t u32CmdBit = SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase);
    uint32_t u32IsQuadEn;

    SPIM_DISABLE_DMM_BWEN(spim);
    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CmdBit);

    /* Set SPIM DTR Mode */
    SPIM_SET_DTR_MODE(spim, psPhaseTable->u32CMDDTR);

    u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddr, u32CmdBit);

    if (i32Ret != SPIM_OK)
    {
        SPIM_SET_DTR_MODE(spim, u32SavedDTREn);
        return;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CmdBit);
    }

    /* Set Flash Command Phase */
    (void)_SPIM_SetCMDPhase(spim,
                            u32OPMode,
                            psPhaseTable->u32CMDPhase,
                            psPhaseTable->u32CMDWidth,
                            psPhaseTable->u32CMDDTR);

    /* Set Flash Address Phase */
    (void)_SPIM_SetAddrPhase(spim,
                             u32OPMode,
                             psPhaseTable->u32AddrPhase,
                             psPhaseTable->u32AddrWidth,
                             psPhaseTable->u32AddrDTR);

