OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    /* Set DMA Read/DMM Continue Read Phase */
    (void)_SPIM_SetContReadPhase(spim,
                                 u32OPMode,
                                 psPhaseTable->u32RdModePhase,
                                 psPhaseTable->u32RdModeWidth,
                                 psPhaseTable->u32ContRdEn,
                                 psPhaseTable->u32RdModeDTR);

    /* Set Flash Data Phase */
    (void)_SPIM_SetDataPhase(spim,
                             u32OPMode,
                             psPhaseTable->u32DataPhase,
                             psPhaseTable->u32ByteOrder,
                             psPhaseTable->u32DataDTR,
                             psPhaseTable->u32RDQS);

    /* Set Dummy Cycle After Address. */
    if (u32OPMode == SPIM_CTL0_OPMODE_PAGEREAD)
    {
        SPIM_SET_DMAR_DC(spim, psPhaseTable->u32DcNum);
    }
    else if (u32OPMode == SPIM_CTL0_OPMODE_DIRECTMAP)
    {
        SPIM_SET_DMM_DC(spim, psPhaseTable->u32DcNum);
    }
    else
    {
        /* Do nothing for Page Write mode. */
    }
}

/*----------------------------------------------------------------------------*/
/* I/O Read/Write Operations by Phase Table                                   */
/*----------------------------------------------------------------------------*/
/**
 * @brief      Send command phase in Normal I/O mode.
 *
 * @param[in]  spim         Pointer to the SPIM instance.
 * @param[in]  u32OPMode    Normal I/O operation mode:
 *                          - \ref SPIM_IO_WRITE_PHASE : Write command phase
 *                          - \ref SPIM_IO_READ_PHASE  : Read command phase
 * @param[in]  u32OpCMD     SPI Flash command to send, defined by the SPI Flash specification.
 * @param[in]  u32CMDPhase  Command bit mode:
 *                          - \ref PHASE_NORMAL_MODE : Send command using Standard mode
 *                          - \ref PHASE_DUAL_MODE   : Send command using Dual mode
 *                          - \ref PHASE_QUAD_MODE   : Send command using Quad mode
 *                          - \ref PHASE_OCTAL_MODE  : Send command using Octal mode
 * @param[in]  u32DTREn     Enable or disable Double Transfer Rate (DTR) mode:
 *                          - \ref SPIM_OP_ENABLE
 *                          - \ref SPIM_OP_DISABLE
 * @return     None.
 */
void SPIM_IO_SendCommandByPhase(SPIM_T *spim, uint32_t u32OPMode, uint32_t u32OpCMD,
                                uint32_t u32CMDPhase, uint32_t u32DTREn)
{
    const uint8_t u8CmdBuf[2] = {(uint8_t)u32OpCMD, (uint8_t)u32OpCMD};

    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write Enable. */
        SPIM_SetWriteEnable(spim, SPIM_OP_ENABLE, SPIM_PhaseModeToNBit(u32CMDPhase));
    }

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    /* Write out command. */
    (void)_SPIM_WriteData(spim, u8CmdBuf, (u32DTREn == SPIM_OP_ENABLE) ? 2UL : 1UL, SPIM_PhaseModeToNBit(u32CMDPhase));

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Send address phase in Normal I/O mode.
 *
 * @param[in]  spim             Pointer to the SPIM instance.
 * @param[in]  u32Is4ByteAddr   Specify whether to use 4-byte address mode (1: 4-byte, 0: 3-byte).
 * @param[in]  u32Addr          The starting read/write address to be sent.
 * @param[in]  u32AddrPhase     Address bit mode:
 *                              - \ref PHASE_NORMAL_MODE : Send address using Standard mode.
 *                              - \ref PHASE_DUAL_MODE   : Send address using Dual mode.
 *                              - \ref PHASE_QUAD_MODE   : Send address using Quad mode.
 *                              - \ref PHASE_OCTAL_MODE  : Send address using Octal mode.
 * @param[in]  u32DTREn         Enable or disable Double Transfer Rate (DTR) mode:
 *                              - \ref SPIM_OP_ENABLE
 *                              - \ref SPIM_OP_DISABLE
 * @return     None.
 */
void SPIM_IO_SendAddressByPhase(SPIM_T *spim,
                                uint32_t u32Is4ByteAddr,
                                uint32_t u32Addr,
                                uint32_t u32AddrPhase,
                                uint32_t u32DTREn)
{
    uint8_t u8CmdBuf[6] = {0};
    uint8_t u8BufIdx = 0;

    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    if (u32Is4ByteAddr)
    {
        u8CmdBuf[u8BufIdx] = (uint8_t)(u32Addr >> 24);
        u8BufIdx++;
    }

    u8CmdBuf[u8BufIdx] = (uint8_t)(u32Addr >> 16);
    u8BufIdx++;
    u8CmdBuf[u8BufIdx] = (uint8_t)(u32Addr >> 8);
    u8BufIdx++;
    u8CmdBuf[u8BufIdx] = (uint8_t)u32Addr;
    u8BufIdx++;

    /* This field is for continuous read mode, but the I/O mode is not supported. */
    if ((gau8IDBuf[0] == (uint8_t)MFGID_WINBOND) &&
            ((SPIM_PhaseModeToNBit(u32AddrPhase) == 2UL) ||
             (SPIM_PhaseModeToNBit(u32AddrPhase) == 4UL)))
    {
        u8BufIdx++;
    }

    /* Write out u32Address. */
    (void)_SPIM_WriteData(spim, u8CmdBuf, u8BufIdx, SPIM_PhaseModeToNBit(u32AddrPhase));

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Send dummy cycles in Normal I/O mode.
 *
 * @param[in]  spim       Pointer to the SPIM instance.
 * @param[in]  u32NDummy  Number of dummy clock cycles to insert, typically defined by the SPI Flash command specification.
 *
 * @retval     SPIM_OK        Operation completed successfully.
 * @retval     SPIM_ERR_FAIL  Operation failed due to invalid configuration or hardware issue.
 */
int32_t SPIM_IO_SendDummyByPhase(SPIM_T *spim, uint32_t u32NDummy)
{
    uint32_t u32DTREn = 0;
    int32_t i32Ret = SPIM_OK;

    if (u32NDummy == 0UL)
    {
        return SPIM_OK;
    }

    u32DTREn = SPIM_GET_DTR_MODE(spim);

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

