OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SwitchNBitInput(spim, SPIM_BITMODE_1);
    spim->TX[0] = 0x00;

    /* Switch to Normal mode. */
    SPIM_SET_OPMODE(spim, SPIM_CTL0_OPMODE_IO);
    SPIM_SET_DATA_WIDTH(spim, u32NDummy);
    SPIM_SET_BURST_DATA(spim, (uint32_t)SPIM_BURSTNUM_1);

    i32Ret = SPIM_WaitOpDone(spim, SPIM_OP_ENABLE);

    /* Restore DTR Mode. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    return i32Ret;
}

/**
 * @brief      Execute data phase in Normal I/O mode.
 *
 * @param[in]  spim           Pointer to the SPIM instance.
 * @param[in]  u32OPMode      Operation mode for Normal I/O.
 *                            - \ref SPIM_IO_WRITE_PHASE : Write mode.
 *                            - \ref SPIM_IO_READ_PHASE  : Read mode.
 * @param[in,out] pu8TRxBuf   Pointer to transmit or receive data buffer.
 *                            - In write mode: pointer to transmit data.
 *                            - In read mode: buffer for received data.
 * @param[in]  u32TRxSize     Size of data to transmit or receive in bytes.
 * @param[in]  u32DataPhase   Data phase bit mode.
 *                            - \ref PHASE_NORMAL_MODE : Standard mode.
 *                            - \ref PHASE_DUAL_MODE   : Dual mode.
 *                            - \ref PHASE_QUAD_MODE   : Quad mode.
 *                            - \ref PHASE_OCTAL_MODE  : Octal mode.
 * @param[in]  u32DTREn       Enable or disable DTR (Double Transfer Rate) mode.
 *                            - \ref SPIM_OP_ENABLE
 *                            - \ref SPIM_OP_DISABLE
 * @param[in]  u32RdDQS       Enable or disable DQS input during read.
 *                            - \ref SPIM_OP_ENABLE
 *                            - \ref SPIM_OP_DISABLE
 *
 * @retval     SPIM_OK        Operation successful.
 * @retval     SPIM_ERR_FAIL  Operation failed.
 */
void SPIM_IO_RWDataByPhase(SPIM_T *spim, uint32_t u32OPMode, uint8_t *pu8TRxBuf,
                           uint32_t u32TRxSize, uint32_t u32DataPhase, uint32_t u32DTREn, uint32_t u32RdDQS)
{
    /* DTR Activated. */
    SPIM_SET_DTR_MODE(spim, u32DTREn);

    /* CS activated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_ENABLE);

    if (gau8IDBuf[0] == (uint8_t)MFGID_IFX)
    {
        SPIM_SET_RDQS_MODE(spim, u32RdDQS);
    }

    if (u32OPMode == SPIM_IO_WRITE_PHASE)
    {
        /* Write out data. */
        (void)_SPIM_WriteData(spim, pu8TRxBuf, u32TRxSize, SPIM_PhaseModeToNBit(u32DataPhase));
    }
    else
    {
        /* Read back data. */
        (void)_SPIM_ReadData(spim, pu8TRxBuf, u32TRxSize, SPIM_PhaseModeToNBit(u32DataPhase));
    }

    /* CS Deactivated. */
    SPIM_SET_SS_EN(spim, SPIM_OP_DISABLE);

    SPIM_SET_RDQS_MODE(spim, SPIM_OP_DISABLE);

    /* DTR Deactivated. */
    SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
}

/**
 * @brief      Write data to SPI Flash using command and phase settings in Normal I/O mode.
 *
 * @param[in]  spim            Pointer to the SPIM instance.
 * @param[in]  psPhaseTable    Pointer to the SPIM phase table, which contains command and phase configuration.
 * @param[in]  u32Addr         Target address in SPI Flash to write data.
 * @param[in]  u32Is4ByteAddr  Set to 1 for 4-byte addressing mode, 0 for 3-byte mode.
 * @param[in]  pu8TxBuf        Pointer to the data buffer to be written to SPI Flash.
 * @param[in]  u32RdSize       Number of bytes to write.
 * @param[in]  u32WrDone       Set to 1 to wait for write complete; 0 to return immediately.
 *
 * @return     None.
 */
static void SPIM_WriteInPageDataByPhaseIO(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                                          uint32_t u32Addr, uint32_t u32Is4ByteAddr,
                                          uint8_t *pu8TxBuf, uint32_t u32RdSize,
                                          uint32_t u32WrDone)
{
    /* Send command and address. */
    SPIM_IO_SendCommandByPhase(spim, SPIM_IO_WRITE_PHASE, psPhaseTable->u32CMDCode,
                               psPhaseTable->u32CMDPhase, psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddressByPhase(spim,
                               u32Is4ByteAddr,
                               u32Addr,
                               psPhaseTable->u32AddrPhase,
                               psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    (void)SPIM_IO_SendDummyByPhase(spim, psPhaseTable->u32DcNum);

    /* Write out data bytes. */
    SPIM_IO_RWDataByPhase(spim,
                          SPIM_IO_WRITE_PHASE,
                          pu8TxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR,
                          psPhaseTable->u32RDQS);

    if (u32WrDone)
    {
        /* DTR Activated. */
        SPIM_SET_DTR_MODE(spim, psPhaseTable->u32CMDDTR);

        (void)_SPIM_WaitWriteDone(spim, SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase));

        /* DTR Deactivated. */
        SPIM_SET_DTR_MODE(spim, SPIM_OP_DISABLE);
    }
}

/**
 * @brief      Write data to SPI Flash using specified phase settings (I/O mode).
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  psPhaseTable  Pointer to the phase table based on SPI Flash specifications.
 *                           This table defines the command and associated phase parameters.
 * @param[in]  u32Addr       Target address in SPI Flash to begin writing.
 * @param[in]  pu8TxBuf      Pointer to the data buffer to be written.
 * @param[in]  u32WrSize     Number of bytes to write.
 * @param[in]  u32WrDone     Set to 1 to wait for write completion; 0 to skip waiting.
 *
 * @return     None.
 */
void SPIM_IO_WriteByPhase(SPIM_T *spim, SPIM_PHASE_T *psPhaseTable,
                          uint32_t u32Addr, uint8_t *pu8TxBuf, uint32_t u32WrSize, uint32_t u32WrDone)
{
    int32_t i32Ret;
    uint32_t u32DTREn = SPIM_GET_DTR_MODE(spim);
    /* Buffer index. */
    uint32_t u32BufIdx = 0UL;
    uint32_t u32AddrTmp = u32Addr;
    uint32_t u32WrSizeTmp = u32WrSize;
    /* 4-byte address mode or not. */
    uint32_t u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32)
                               ? SPIM_OP_ENABLE
                               : SPIM_OP_DISABLE);
    /* Quad mode or not. */
    uint32_t u32CMDBits = SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase);
    uint32_t u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                             (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    uint32_t u32IsQuadEn;

    SPIM_DISABLE_DMM_BWEN(spim);
    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CMDBits);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddr, u32CMDBits);

    if (i32Ret != SPIM_OK)
    {
        SPIM_SET_DTR_MODE(spim, u32DTREn);
        return;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CMDBits);
    }

    while (u32WrSizeTmp)
    {
        /* The number of bytes to write*/
        uint32_t toWr = (u32WrSizeTmp < SPIM_FLH_PAGE_SIZE) ? u32WrSizeTmp : SPIM_FLH_PAGE_SIZE;

        SPIM_WriteInPageDataByPhaseIO(spim, psPhaseTable, u32AddrTmp, u32Is4ByteAddr, &pu8TxBuf[u32BufIdx], toWr, u32WrDone);
        /* Advance indicator. */
        u32AddrTmp += toWr;
        u32WrSizeTmp -= toWr;
        u32BufIdx += toWr;
    }

