OpenNuvoton/M55M1BSP/Library/StdDriver/src/spim.c
    SPIM_SET_DTR_MODE(spim, u32DTREn);
}

/**
 * @brief      Read data from SPI Flash using specified phase settings (I/O mode).
 *
 * @param[in]  spim          Pointer to the SPIM instance.
 * @param[in]  psPhaseTable  Pointer to the SPI Flash phase configuration table.
 *                           This table defines supported commands and transfer phases.
 * @param[in]  u32Addr       Starting address in SPI Flash to read from.
 * @param[out] pu8RxBuf      Pointer to the buffer to store read data.
 * @param[in]  u32RdSize     Number of bytes to read.
 *
 * @return     None.
 */
void SPIM_IO_ReadByPhase(SPIM_T *spim, const SPIM_PHASE_T *psPhaseTable, uint32_t u32Addr, uint8_t *pu8RxBuf, uint32_t u32RdSize)
{
    int32_t i32Ret;
    uint32_t u32DTREn = SPIM_GET_DTR_MODE(spim);
    uint32_t u32Is4ByteAddr = ((psPhaseTable->u32AddrWidth == PHASE_WIDTH_32) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    uint32_t u32CMDBits = SPIM_PhaseModeToNBit(psPhaseTable->u32CMDPhase);
    uint32_t u32QuadMode = (((psPhaseTable->u32AddrPhase == PHASE_QUAD_MODE) ||
                             (psPhaseTable->u32DataPhase == PHASE_QUAD_MODE)) ? SPIM_OP_ENABLE : SPIM_OP_DISABLE);
    uint32_t u32IsQuadEn;

    SPIM_DISABLE_DMM_BWEN(spim);
    SPIM_DISABLE_DMM_CREN(spim);
    SPIM_CLEAR_MODE_DATA(spim);

    u32IsQuadEn = SPIM_IsQuadEnabled(spim, u32CMDBits);

    /* Enable/disable 4-Byte Address. */
    i32Ret = _SPIM_Sync4ByteAddrMode(spim, u32Is4ByteAddr, u32CMDBits);

    if (i32Ret != SPIM_OK)
    {
        SPIM_SET_DTR_MODE(spim, u32DTREn);
        return;
    }

    if (u32QuadMode && (u32IsQuadEn == SPIM_OP_DISABLE))
    {
        SPIM_SetQuadEnable(spim, u32QuadMode, u32CMDBits);
    }

    /* send command, address, dummy, data */
    SPIM_IO_SendCommandByPhase(spim,
                               SPIM_IO_READ_PHASE,
                               psPhaseTable->u32CMDCode,
                               psPhaseTable->u32CMDPhase,
                               psPhaseTable->u32CMDDTR);

    SPIM_IO_SendAddressByPhase(spim,
                               u32Is4ByteAddr,
                               u32Addr,
                               psPhaseTable->u32AddrPhase,
                               psPhaseTable->u32AddrDTR);

    /* Write out dummy bytes. */
    (void)SPIM_IO_SendDummyByPhase(spim, psPhaseTable->u32DcNum);

    SPIM_IO_RWDataByPhase(spim,
                          SPIM_IO_READ_PHASE,
                          pu8RxBuf,
                          u32RdSize,
                          psPhaseTable->u32DataPhase,
                          psPhaseTable->u32DataDTR,
                          psPhaseTable->u32RDQS);

    SPIM_SET_DTR_MODE(spim, u32DTREn);
}

/**
 * @brief      Enable the SPIM DLL (Delay Locked Loop) circuit.
 *
 * @param[in]  spim      Pointer to the SPIM instance.
 *
 * @retval     SPIM_OK           DLL locked successfully.
 * @retval     SPIM_ERR_TIMEOUT  DLL lock failed due to timeout.
 *
 * @note       After a system wake-up or reset, this function must be called again
 *             to reinitialize the DLL.
 */
int32_t SPIM_INIT_DLL(SPIM_T *spim)
{
    int32_t i32Ret = SPIM_OK;
    volatile int i32TimeoutCount = (int32_t)SPIM_TIMEOUT;
    uint32_t u32SclkHz = CLK_GetSCLKFreq();
    uint32_t u32ClkDiv = SPIM_GET_CLOCK_DIVIDER(spim);
    uint32_t u32BusClkHz;
    uint32_t u32ClkNs;
    uint32_t u32Divisor;
    const uint32_t u32DllLockUs  = 20;
    const uint32_t u32DllValidUs = 50;
    const uint32_t u32DllClkOnUs = 20;
    const uint32_t u32DllTrimUs  = 20;
    uint32_t u32DelayCycleCount = 0;
    // Convert to cycles
    uint32_t u32DLLLKNUM;
    uint32_t u32DLLOVNUM;
    uint32_t u32CLKONNUM;
    uint32_t u32TRIMNUM;
    uint32_t u32Div = (u32ClkDiv == 0UL) ? 1UL : (u32ClkDiv * 2UL);
    uint32_t u32FreqMHz;
    uint32_t u32FastEn;
    uint32_t u32DllDivCode = (u32Div <= 1UL) ? 0UL : (u32Div == 2UL) ? 1UL : (u32Div == 4UL) ? 2UL : 3UL;
    uint32_t u32RegLockLevel = SYS_IsRegLocked();

    if (u32RegLockLevel)
    {
        SYS_UnlockReg();
    }

    if (u32ClkDiv == 0UL)
    {
        u32BusClkHz = u32SclkHz;
    }
    else
    {
        u32Divisor = u32ClkDiv * 2UL;
        u32BusClkHz = u32SclkHz / u32Divisor;
    }

    if (u32BusClkHz == 0UL)
    {
        return SPIM_ERR_FAIL;
    }

    u32ClkNs = (1000000000UL / u32BusClkHz);
    u32FreqMHz = (u32BusClkHz / 1000000UL);
    u32FastEn = (u32FreqMHz <= 100UL) ? SPIM_OP_DISABLE : SPIM_OP_ENABLE;

    u32DLLLKNUM = SPIM_CEIL_DIV((u32DllLockUs * SPIM_TRIM_MARGIN), u32ClkNs);
    u32DLLOVNUM = SPIM_CEIL_DIV((u32DllValidUs * SPIM_TRIM_MARGIN), u32ClkNs);
    u32CLKONNUM = SPIM_CEIL_DIV((u32DllClkOnUs * SPIM_TRIM_MARGIN), u32ClkNs);
    u32TRIMNUM = SPIM_CEIL_DIV((u32DllTrimUs * SPIM_TRIM_MARGIN), u32ClkNs);

    // DLL timing setup
    SPIM_SET_DLLLOCK_NUM(spim, u32DLLLKNUM);
    SPIM_SET_DLLOV_NUM(spim, u32DLLOVNUM);
    SPIM_SET_DLLCLKON_NUM(spim, u32CLKONNUM);
    SPIM_SET_DLLTRIM_NUM(spim, u32TRIMNUM);

#if (SPIM_TRIM_HYPERDLL == 1)

    SPIM_ENABLE_SYSDLL0ATCTL0_TRIMUPDOFF();
#endif

    /* Set SPIM DLL clock divider */
    SPIM_SET_DLLDIV(spim, u32DllDivCode);

    SPIM_SET_DLLFAST(spim, u32FastEn);

    /* SPIM starts to send DLL reference clock to DLL circuit
       that the frequency is the same as the SPIM output bus clock. */
    /* Enable SPIM DLL output */
    SPIM_ENABLE_DLLOLDO(spim, SPIM_OP_ENABLE);

#if (SPIM_TRIM_HYPERDLL == 1)
    SPIM_SET_AUTO_TRIM_DLL(spim, SPIM_OP_ENABLE);

    SPIM_SET_INTERNAL_RWDS(spim, SPIM_OP_ENABLE);
#endif

    /* User asserts this control register to 0x1,
       the DLL circuit begins searching for lock with DLL reference clock. */
    /* Assert SPIM DLL reset */
    SPIM_ENABLE_DLLOVRST(spim, SPIM_OP_ENABLE);

    /* Polling the DLL status register DLLCKON to 0x1,
       and the value 0x1 indicates that clock divider circuit inside DLL is enabled. */
    while (SPIM_GET_DLLOVRST(spim) == SPIM_OP_ENABLE)
    {
        if (--i32TimeoutCount <= 0)
        {
            i32Ret = SPIM_ERR_TIMEOUT;
            break;
        }
    }

